Repository: GZTimeWalker/GZCTF
Catalog: src/GZCTF/Resources/Program.*.resx
Languages: de_de, es_es, fr_fr, id_id, ja_jp, ko_kr, ru_ru, vi_vn, zh_cn, zh_tw

# MailSender_Template
source: <head> <meta content="text/html; charset=utf-8" http-equiv="Content-Type"/> </head> <body> <div style="max-width: 544px; margin: 0 auto; padding: 20px"> <h2 style="text-align: center">{title}</h2> <p>你好，{userName}！</p> <p style="text-indent: 2em">{information}</p> <p style="text-align: center; padding: 20px"> <a href="{url}" style=" font: 1rem Arial; white-space: nowrap; text-decoration: none; background-color: #000000; color: #ffffff; padding: 10px 20px 10px 20px; border: 1px solid #888888; border-radius: 7px; margin: 10px auto; " > {btnmsg} </a> </p> <div style="font-size: 0.8rem"> <p> 如果以上按钮无效，请复制此链接到浏览器访问：<br/><span style="word-break: break-all; font: 0.8em monospace" >{url} </span> </p> <p>如果你没有进行相关操作，请忽略此封邮件。</p> </div> <p style="font-size: 0.7em; text-align: right; color: #333">GZCTF @ {nowtime}</p> </div> </body>
de_de: <head><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/></head><body><div style="max-width: 544px; margin: 0 auto; padding: 20px"><h2 style="text-align: center">{title}</h2><p>Hallo, {userName}!</p><p style="text-indent: 2em">{information}</p><p style="text-align: center; padding: 20px"><a href="{url}" style="font: 1rem Arial;white-space: nowrap;text-decoration: none;background-color: #000000;color: #ffffff;padding: 10px 20px 10px 20px;border: 1px solid #888888;border-radius: 7px;margin: 10px auto;">{btnmsg}</a></p><div style="font-size: 0.8rem"><p>Wenn der obige Button nicht gültig ist, kopieren Sie diesen Link bitte in Ihren Browser: <br/><span style="word-break: break-all; font: 0.8em monospace">{url}</span></p><p>Wenn Sie dies nicht getan haben, ignorieren Sie bitte diese E-Mail. </p></div><p style="font-size: 0.7em; text-align: right; color: #333">{platform} @ {nowtime}</p></div></body>
es_es: <head><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/></head><body><div style="max-width: 544px; margin: 0 auto; padding: 20px"><h2 style="text-align: center">{title}</h2><p>Hola, {userName}!</p><p style="text-indent: 2em">{information}</p><p style="text-align: center; padding: 20px"><a href="{url}" style="font: 1rem Arial;white-space: nowrap;text-decoration: none;background-color: #000000;color: #ffffff;padding: 10px 20px 10px 20px;border: 1px solid #888888;border-radius: 7px;margin: 10px auto;">{btnmsg}</a></p><div style="font-size: 0.8rem"><p>Si el botón de arriba no es válido, por favor copie este enlace en su navegador: <br/><span style="word-break: break-all; font: 0.8em monospace">{url}</span></p><p>Si no ha realizado esta acción, por favor ignore este correo. </p></div><p style="font-size: 0.7em; text-align: right; color: #333">{platform} @ {nowtime}</p></div></body>
fr_fr: <head><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/></head><body><div style="max-width: 544px; margin: 0 auto; padding: 20px"><h2 style="text-align: center">{title}</h2><p>Bonjour, {userName}!</p><p style="text-indent: 2em">{information}</p><p style="text-align: center; padding: 20px"><a href="{url}" style="font: 1rem Arial;white-space: nowrap;text-decoration: none;background-color: #000000;color: #ffffff;padding: 10px 20px 10px 20px;border: 1px solid #888888;border-radius: 7px;margin: 10px auto;">{btnmsg}</a></p><div style="font-size: 0.8rem"><p>Si le bouton ci-dessus n'est pas valide, veuillez copier ce lien dans votre navigateur : <br/><span style="word-break: break-all; font: 0.8em monospace">{url}</span></p><p>Si vous n'avez pas effectué cette action, veuillez ignorer cet e-mail. </p></div><p style="font-size: 0.7em; text-align: right; color: #333">{platform} @ {nowtime}</p></div></body>
id_id: <head><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/></head><body><div style="max-width: 544px; margin: 0 auto; padding: 20px"><h2 style="text-align: center">{title}</h2><p>Halo, {userName}！</p><p style="text-indent: 2em">{information}</p><p style="text-align: center; padding: 20px"><a href="{url}" style="font: 1rem Arial;white-space: nowrap;text-decoration: none;background-color: #000000;color: #ffffff;padding: 10px 20px 10px 20px;border: 1px solid #888888;border-radius: 7px;margin: 10px auto;">{btnmsg}</a></p><div style="font-size: 0.8rem"><p>Jika tombol di atas tidak berfungsi, silakan salin tautan ini ke browser kamu: <br/><span style="word-break: break-all; font: 0.8em monospace">{url}</span></p><p>Jika kamu belum melakukannya, silakan abaikan email ini.</p></div><p style="font-size: 0.7em; text-align: right; color: #333">{platform} @ {nowtime}</p></div></body>
ja_jp: <head> <meta content="text/html; charset=utf-8" http-equiv="Content-Type"/></head><body><div style="max-width: 544px; margin: 0 auto; padding: 20px"> <h2 style="text-align: center">{title}</h2> <p>ようこそ，{userName}！</p> <p style="text-indent: 2em">{information}</p> <p style="text-align: center; padding: 20px"> <a href="{url}" style=" font: 1rem Arial; white-space: nowrap; text-decoration: none; background-color: #000000; color: #ffffff; padding: 10px 20px 10px 20px; border: 1px solid #888888; border-radius: 7px; margin: 10px auto; " > {btnmsg} </a> </p> <div style="font-size: 0.8rem"> <p> 上のボタンが機能しない場合は、このリンクをブラウザにコピーしてアクセスしてください：<br/><span style="word-break: break-all; font: 0.8em monospace" >{url} </span> </p> <p>このメールに心当たりがない場合はこのメールを無視してください。</p> </div> <p style="font-size: 0.7em; text-align: right; color: #333">{platform} @ {nowtime}</p></div></body>
ko_kr: <head><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/></head><body><div style="max-width: 544px; margin: 0 auto; padding: 20px"><h2 style="text-align: center">{title}</h2><p>{userName} 님 안녕하세요!</p><p style="text-indent: 2em">{information}</p><p style="text-align: center; padding: 20px"><a href="{url}" style="font: 1rem Arial;white-space: nowrap;text-decoration: none;background-color: #000000;color: #ffffff;padding: 10px 20px 10px 20px;border: 1px solid #888888;border-radius: 7px;margin: 10px auto;">{btnmsg}</a></p><div style="font-size: 0.8rem"><p> 만약 위 버튼이 작동하지 않으면, 아래 링크를 브라우저에 입력하세요: <br/><span style="word-break: break-all; font: 0.8em monospace">{url}</span></p><p>만약 가입한 적이 없다면, 이 메일을 무시해주세요</p></div><p style="font-size: 0.7em; text-align: right; color: #333">{platform} @ {nowtime}</p></div></body>
ru_ru: <head><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/></head><body><div style="max-width: 544px; margin: 0 auto; padding: 20px"><h2 style="text-align: center">{title}</h2><p>Здравствуйте, {userName}!</p><p style="text-indent: 2em">{information}</p><p style="text-align: center; padding: 20px"><a href="{url}" style="font: 1rem Arial;white-space: nowrap;text-decoration: none;background-color: #000000;color: #ffffff;padding: 10px 20px 10px 20px;border: 1px solid #888888;border-radius: 7px;margin: 10px auto;">{btnmsg}</a></p><div style="font-size: 0.8rem"><p>Если кнопка выше не работает, откройте следующую ссылку в Вашем браузере: <br/><span style="word-break: break-all; font: 0.8em monospace">{url}</span></p><p>Если Вы не запрашивали это действие, просто проигнорируйте это письмо. </p></div><p style="font-size: 0.7em; text-align: right; color: #333">{platform} @ {nowtime}</p></div></body>
vi_vn: <head><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/></head><body><div style="max-width: 544px; margin: 0 auto; padding: 20px"><h2 style="text-align: center">{title}</h2><p>Xin chào, {userName}!</p><p style="text-indent: 2em">{information}</p><p style="text-align: center; padding: 20px"><a href="{url}" style="font: 1rem Arial;white-space: nowrap;text-decoration: none;background-color: #000000;color: #ffffff;padding: 10px 20px 10px 20px;border: 1px solid #888888;border-radius: 7px;margin: 10px auto;">{btnmsg}</a></p><div style="font-size: 0.8rem"><p>Nếu nút trên không hợp lệ, vui lòng sao chép liên kết này vào trình duyệt của bạn: <br/><span style="word-break: break-all; font: 0.8em monospace">{url}</span></p><p>Nếu bạn chưa thực hiện hành động này, vui lòng bỏ qua email này.</p></div><p style="font-size: 0.7em; text-align: right; color: #333">{platform} @ {nowtime}</p></div></body>
zh_tw: <head><meta content="text/html; charset=utf-8" http-equiv="Content-Type"/></head><body><div style="max-width: 544px; margin: 0 auto; padding: 20px"><h2 style="text-align: center">{title}</h2><p>你好，{userName}！</p><p style="text-indent: 2em">{information}</p><p style="text-align: center; padding: 20px"><a href="{url}" style="font: 1rem Arial;white-space: nowrap;text-decoration: none;background-color: #000000;color: #ffffff;padding: 10px 20px 10px 20px;border: 1px solid #888888;border-radius: 7px;margin: 10px auto;">{btnmsg}</a></p><div style="font-size: 0.8rem"><p>如果以上按鈕無效，請複製此連結到瀏覽器訪問：<br/><span style="word-break: break-all; font: 0.8em monospace">{url}</span></p><p>如果你沒有進行相關操作，請忽略此封郵件。</p></div><p style="font-size: 0.7em; text-align: right; color: #333">{platform} @ {nowtime}</p></div></body>

# MailSender_VerifyEmailButton
source: Verify Email
de_de: E-Mail verifizieren
es_es: Verificar correo electrónico
fr_fr: Vérifier l'e-mail
id_id: Verifikasi email
ja_jp: メールを確認する
ko_kr: 이메일 인증
ru_ru: Подтвердить E-mail
vi_vn: Xác minh mail
zh_tw: 確認驗證郵箱

# MailSender_VerifyEmailContent
source: You are in the process of registering your account. We need to verify your registration email：{0}. Please click the button below to verify it.
de_de: Sie sind dabei, Ihr Konto zu registrieren. Wir müssen Ihre Registrierungs-E-Mail verifizieren: {0}. Bitte klicken Sie auf den unten stehenden Button, um sie zu verifizieren.
es_es: Está en el proceso de registrar su cuenta. Necesitamos verificar su correo electrónico de registro: {0}. Por favor, haga clic en el botón de abajo para verificarlo.
fr_fr: Vous êtes en train d'enregistrer votre compte. Nous devons vérifier votre e-mail d'enregistrement : {0}. Veuillez cliquer sur le bouton ci-dessous pour le vérifier.
id_id: Kamu sedang dalam proses mendaftarkan akunmu. Kami perlu memverifikasi email pendaftaran: {0}. Silakan klik tombol di bawah ini untuk memverifikasinya.
ja_jp: アカウント登録を行っています。メールアドレス {0} を確認し、以下のボタンをクリックして認証を実行してください。
ko_kr: 가입한 이메일 주소 {0}를 인증해야합니다. 아래 버튼을 눌러 인증하세요.
ru_ru: Вы получили это письмо, так как указали почту {0} при регистрации аккаунта на платформе. Пожалуйста, нажмите кнопку ниже, чтобы подтвердить E-mail и активировать Ваш аккаунт.
vi_vn: Bạn đang trong quá trình đăng ký tài khoản. Chúng tôi cần xác minh email đăng ký của bạn: {0}. Vui lòng nhấp vào nút bên dưới để xác minh.
zh_tw: 你正在進行帳戶註冊操作，我們需要驗證你的註冊郵箱：{0}，請點擊下方按鈕進行驗證。

# MailSender_VerifyEmailTitle
source: Verify Email
de_de: E-Mail verifizieren
es_es: Verificar correo electrónico
fr_fr: Vérifier l'e-mail
id_id: Verifikasi Email
ja_jp: メール認証
ko_kr: 이메일 인증
ru_ru: Подтверждение E-mail
vi_vn: Xác minh mail
zh_tw: 驗證郵箱

# Model_BioTooLong
source: Description is too long
de_de: Beschreibung ist zu lang
es_es: La descripción es demasiado larga
fr_fr: La description est trop longue
id_id: Deskripsi terlalu panjang
ja_jp: 説明が長すぎます
ko_kr: 설명이 너무 깁니다.
ru_ru: Описание слишком длинное
vi_vn: Mô tả quá dài
zh_tw: 描述過長

# Model_ContentRequired
source: Content is required
de_de: Inhalt ist erforderlich
es_es: El contenido es obligatorio
fr_fr: Le contenu est requis
id_id: Konten diperlukan
ja_jp: 内容は必須です
ko_kr: 내용을 적어주세요.
ru_ru: Отсутствует содержимое
vi_vn: Nội dung là bắt buộc
zh_tw: 內容是必需的

# Model_EmailMalformed
source: Email is invalid
de_de: E-Mail ist ungültig
es_es: El correo electrónico es inválido
fr_fr: L'e-mail est invalide
id_id: Email tidak valid
ja_jp: メールアドレスが無効です
ko_kr: 잘못된 이메일
ru_ru: Недопустимый E-mail
vi_vn: Email không hợp lệ
zh_tw: 郵箱地址無效

# Model_EmailRequired
source: Email is required
de_de: E-Mail ist erforderlich
es_es: El correo electrónico es obligatorio
fr_fr: L'e-mail est requis
id_id: Email diperlukan
ja_jp: メールアドレスは必須です
ko_kr: 이메일을 입력하세요
ru_ru: Необходимо указать E-mail
vi_vn: Email là bắt buộc
zh_tw: 郵箱是必需的

# Model_FlagRequired
source: Flag is required
de_de: Flag ist erforderlich
es_es: La bandera es obligatoria
fr_fr: Le drapeau est requis
id_id: Flag diperlukan
ja_jp: フラッグは必須です
ko_kr: 플래그를 입력하세요
ru_ru: Необходимо указать флаг
vi_vn: Flag là bắt buộc
zh_tw: flag 是必需的

# Model_FlagTooLong
source: Flag is too long
de_de: Flag ist zu lang
es_es: La bandera es demasiado larga
fr_fr: Le drapeau est trop long
id_id: Flag terlalu panjang
ja_jp: フラッグ文字列が長すぎます
ko_kr: 플래그가 너무 깁니다
ru_ru: Флаг слишком длинный
vi_vn: Flag quá dài
zh_tw: flag 字符串過長

# Model_InvitationCodeTooLong
source: Invitation code is too long
de_de: Einladungscode ist zu lang
es_es: El código de invitación es demasiado largo
fr_fr: Le code d'invitation est trop long
id_id: Kode undangan terlalu panjang
ja_jp: 招待コードが長すぎます
ko_kr: 초대 코드가 너무 깁니다.
ru_ru: Код приглашения слишком длинный
vi_vn: Mã mời quá dài
zh_tw: 邀請碼過長

# Model_MalformedPhoneNumber
source: Invalid phone number
de_de: Ungültige Telefonnummer
es_es: Número de teléfono inválido
fr_fr: Numéro de téléphone invalide
id_id: Nomor telepon tidak valid
ja_jp: 電話番号は無効です
ko_kr: 유효하지 않은 전화번호
ru_ru: Некорректный номер телефона
vi_vn: Số điện thoại không hợp lệ
zh_tw: 手機號格式錯誤

# Model_NewPasswordRequired
source: A new password is required
de_de: Ein neues Passwort ist erforderlich
es_es: Se requiere una nueva contraseña
fr_fr: Un nouveau mot de passe est requis
id_id: Kata sandi baru diperlukan
ja_jp: 新しいパスワードは必須です
ko_kr: 새 비밀번호가 필요합니다.
ru_ru: Необходимо ввести новый пароль
vi_vn: Cần mật khẩu mới
zh_tw: 新密碼是必需的

# Model_NewPasswordTooShort
source: New password is too short
de_de: Neues Passwort ist zu kurz
es_es: La nueva contraseña es demasiado corta
fr_fr: Le nouveau mot de passe est trop court
id_id: Kata sandi baru terlalu pendek
ja_jp: 新しいパスワードが短すぎます
ko_kr: 새 비밀번호가 너무 짧습니다.
ru_ru: Новый пароль слишком короткий
vi_vn: Mật khẩu mới quá ngắn
zh_tw: 新密碼過短

# Model_OldPasswordRequired
source: The old password is required
de_de: Das alte Passwort ist erforderlich
es_es: Se requiere la contraseña anterior
fr_fr: L'ancien mot de passe est requis
id_id: Kata sandi lama diperlukan
ja_jp: 古いパスワードは必須です
ko_kr: 예전 비밀번호가 필요합니다.
ru_ru: Необходимо ввести старый пароль
vi_vn: Mật khẩu cũ là bắt buộc
zh_tw: 舊密碼是必需的

# Model_OldPasswordTooShort
source: Old password is too short
de_de: Altes Passwort ist zu kurz
es_es: La contraseña anterior es demasiado corta
fr_fr: L'ancien mot de passe est trop court
id_id: Kata sandi lama terlalu pendek
ja_jp: 古いパスワードが短すぎます
ko_kr: 예전 비밀번호가 너무 짧습니다.
ru_ru: Старый пароль слишком короткий
vi_vn: Mật khẩu cũ quá ngắn
zh_tw: 舊密碼過短

# Model_OutOfRange
source: The value of {0} must be between {1} and {2}
de_de: Der Wert von {0} muss zwischen {1} und {2} liegen
es_es: El valor de {0} debe estar entre {1} y {2}
fr_fr: La valeur de {0} doit être entre {1} et {2}
id_id: Nilai {0} harus antara {1} dan {2}
ja_jp: {0} の値は {1} - {2} である必要があります
ko_kr: {0} 의 길이를 {1} 에서 {2} 사이로 입력해주세요
ru_ru: Значение параметра {0} должно находиться между {1} и {2}
vi_vn: Giá trị của {0} phải nằm trong khoảng từ {1} đến {2}
zh_tw: {0} 的值必須介於 {1} - {2}

# Model_PasswordRequired
source: Password is required
de_de: Passwort ist erforderlich
es_es: Se requiere la contraseña
fr_fr: Le mot de passe est requis
id_id: Password diperlukan
ja_jp: パスワードは必須です
ko_kr: 비밀번호를 적어주세요.
ru_ru: Необходимо ввести пароль
vi_vn: Mật khẩu là bắt buộc
zh_tw: 密碼是必需的

# Model_RealNameTooLong
source: Real name is too long
de_de: Echter Name ist zu lang
es_es: El nombre real es demasiado largo
fr_fr: Le nom réel est trop long
id_id: Nama asli terlalu panjang
ja_jp: 本名が長すぎます
ko_kr: 실제 이름이 너무 깁니다.
ru_ru: Настоящее имя слишком длинное
vi_vn: Tên quá dài
zh_tw: 真實姓名過長

# Model_StdNumberTooLong
source: Student number is too long
de_de: Matrikelnummer ist zu lang
es_es: El número de estudiante es demasiado largo
fr_fr: Le numéro d'étudiant est trop long
id_id: Nomor siswa terlalu panjang
ja_jp: ID 番号が長すぎます。
ko_kr: 학번이 너무 깁니다.
ru_ru: Номер билета слишком длинный
vi_vn: Mã sinh viên quá dài
zh_tw: 學工號過長

# Model_TeamBioTooLong
source: Team bio is too long
de_de: Team-Biografie ist zu lang
es_es: La biografía del equipo es demasiado larga
fr_fr: La biographie de l'équipe est trop longue
id_id: Bio tim terlalu panjang
ja_jp: チーム署名が長すぎます
ko_kr: 팀 bio 가 너무 깁니다.
ru_ru: Описание команды слишком длинное
vi_vn: Giới thiệu đội quá dài
zh_tw: 隊伍籤名過長

# Model_TeamNameTooLong
source: Team name is too long
de_de: Teamname ist zu lang
es_es: El nombre del equipo es demasiado largo
fr_fr: Le nom de l'équipe est trop long
id_id: Nama tim terlalu panjang
ja_jp: チーム名が長すぎます
ko_kr: 팀 이름이 너무 깁니다.
ru_ru: Название команды слишком длинное
vi_vn: Tên đội quá dài
zh_tw: 隊伍名稱過長

# Model_TitleRequired
source: Title is required
de_de: Titel ist erforderlich
es_es: Se requiere el título
fr_fr: Le titre est requis
id_id: Judul diperlukan
ja_jp: タイトルは必須です
ko_kr: 제목을 적어주세요.
ru_ru: Необходимо указать название
vi_vn: Tiêu đề là bắt buộc
zh_tw: 標題是必需的

# Model_TitleTooLong
source: Title is too long
de_de: Titel ist zu lang
es_es: El título es demasiado largo
fr_fr: Le titre est trop long
id_id: Judul terlalu panjang
ja_jp: タイトルが長すぎます
ko_kr: 제목이 너무 깁니다.
ru_ru: Название слишком длинное
vi_vn: Tiêu đề quá dài
zh_tw: 標題過長

# Model_TitleTooShort
source: Title is too short
de_de: Titel ist zu kurz
es_es: El título es demasiado corto
fr_fr: Le titre est trop court
id_id: Judul terlalu pendek
ja_jp: タイトルが短すぎます。
ko_kr: 제목이 너무 짧습니다.
ru_ru: Название слишком короткое
vi_vn: Tiêu đề quá ngắn
zh_tw: 標題過短

# Model_TokenRequired
source: Token is required
de_de: Token ist erforderlich
es_es: Se requiere el token
fr_fr: Le jeton est requis
id_id: Token di perlukan
ja_jp: Token は必須です
ko_kr: 토큰이 필요합니다.
ru_ru: Необходимо ввести токен
vi_vn: Token là bắt buộc
zh_tw: Token是必需的

# Model_UserNameRequired
source: Username is required
de_de: Benutzername ist erforderlich
es_es: Se requiere el nombre de usuario
fr_fr: Le nom d'utilisateur est requis
id_id: Username diperlukan
ja_jp: ユーザー名は必須です
ko_kr: 이름을 적어주세요
ru_ru: Необходимо ввести имя пользователя
vi_vn: Tên người dùng là bắt buộc
zh_tw: 用戶名是必需的

# Model_UserNameTooLong
source: Username is too long
de_de: Benutzername ist zu lang
es_es: El nombre de usuario es demasiado largo
fr_fr: Le nom d'utilisateur est trop long
id_id: Username terlalu panjang
ja_jp: ユーザー名が長すぎます
ko_kr: 이름이 너무 깁니다.
ru_ru: Слишком длинное имя пользователя
vi_vn: Tên người dùng quá dài
zh_tw: 用戶名過長

# Model_UserNameTooShort
source: Username is too short
de_de: Benutzername ist zu kurz
es_es: El nombre de usuario es demasiado corto
fr_fr: Le nom d'utilisateur est trop court
id_id: Username terlalu pendek
ja_jp: ユーザー名が短すぎます
ko_kr: 이름이 너무 짧습니다.
ru_ru: Слишком короткое имя пользователя
vi_vn: Tên người dùng quá ngắn
zh_tw: 用戶名過短

# Model_ValidationFailed
source: Failed to validate the input, please check again
de_de: Die Eingabe konnte nicht validiert werden, bitte erneut überprüfen
es_es: Error al validar la entrada, por favor verifica de nuevo
fr_fr: Échec de la validation de la saisie, veuillez vérifier à nouveau
id_id: Gagal memvalidasi inputan, silakan periksa kembali
ja_jp: 入力が正しくありませんので確認してください。
ko_kr: 입력 인증 실패. 다시 시도해주세요
ru_ru: Не удалось проверить ввод. Пожалуйста, убедитесь, что он соответствует требованиям
vi_vn: Đầu vào không hợp lệ, vui lòng kiểm tra và thử lại.
zh_tw: 校驗失敗，請檢查輸入。

# Post_NotFound
source: The post was not found
de_de: Der Beitrag wurde nicht gefunden
es_es: La publicación no fue encontrada
fr_fr: Le post n'a pas été trouvé
id_id: Postingan tidak ditemukan
ja_jp: 投稿は見つかりませんでした
ko_kr: 해당 글을 찾을 수 없습니다.
ru_ru: Пост не найден
vi_vn: Không tìm thấy bài viết
zh_cn: 文章不存在
zh_tw: 文章不存在

# RateLimit_TooManyRequests
source: Too many requests. Please try again in {0} seconds.
de_de: Zu viele Anfragen. Bitte versuche es in {0} Sekunden erneut.
es_es: Demasiadas solicitudes. Por favor, inténtalo de nuevo en {0} segundos.
fr_fr: Trop de demandes. Veuillez réessayer dans {0} secondes.
id_id: Terlalu banyak permintaan. Silakan coba lagi dalam {0} detik.
ja_jp: リクエストが多すぎます。{0} 秒後にもう一度お試しください。
ko_kr: 너무 많은 요청. {0} 초 후 다시 시도해주세요.
ru_ru: Слишком много запросов. Пожалуйста, повторите попытку через {0} секунд.
vi_vn: Bạn đã gửi quá nhiều yêu cầu trong thời gian ngắn. Vui lòng thử lại sau {0} giây.
zh_tw: 請求次數過多，請 {0} 秒後再試。

# Scoreboard_AllSubmissions
source: All Submissions
de_de: Alle Einreichungen
es_es: Todas las presentaciones
fr_fr: Toutes les soumissions
id_id: Semua submission
ja_jp: すべて提出します
ko_kr: 제출
ru_ru: Все отправления
vi_vn: Tất cả bài nộp
zh_tw: 全部提交

# Scoreboard_BelongingOrganization
source: Organization
ja_jp: 所属組織

# Scoreboard_TeamNotLoaded
source: Team not loaded yet
de_de: Team nicht geladen
es_es: El equipo aún no se ha cargado
fr_fr: Équipe non chargée
id_id: Tim belum dimuat
ja_jp: チームがロードされていません
ko_kr: 팀이 로드되지 않았습니다.
ru_ru: Команда ещё не загружена
vi_vn: Đội chưa được tải
zh_tw: 隊伍尚未加載

# Scoreboard_Title
source: Scoreboard
es_es: Marcador
fr_fr: Tableau des scores
id_id: Papan Skor
ja_jp: スコアボード
ko_kr: 스코어보드
ru_ru: Рейтинг
vi_vn: Bảng điểm
zh_tw: 排行榜

source: Server exited
de_de: Server beendet
es_es: El servidor ha salido
fr_fr: Serveur terminé
id_id: Server keluar
ja_jp: サーバーは終了しました
ko_kr: 서버 종료됨
ru_ru: Сервер отключился
vi_vn: Hệ thống đã thoát
zh_cn: 服务器已退出
zh_tw: 伺服器已退出

# Server_Failed
source: Server exited unexpectedly due to exceptions
de_de: Server wurde unerwartet aufgrund von Ausnahmen beendet
es_es: El servidor salió inesperadamente debido a excepciones
fr_fr: Serveur terminé de manière inattendue en raison d'exceptions
id_id: Server keluar secara tidak terduga karena kesalahan
ja_jp: サーバーは例外により予期せず終了しました
ko_kr: 오류로 인해 서버가 예기치 않게 종료되었습니다.
ru_ru: Сервер неожиданно отключился из-за ошибок
vi_vn: Hệ thống gặp lỗi không mong muốn và đã thoát
zh_cn: 因异常，应用程序意外终止
zh_tw: 因異常，應用程式意外終止

# Submission_Accepted
source: Answer accepted
de_de: AKZEPTIERT
es_es: ACEPTADO
fr_fr: ACCEPTÉ
id_id: DITERIMA
ja_jp: 回答正解
ko_kr: 승인됨
ru_ru: ПРИНЯТО
vi_vn: CHẤP NHẬN
zh_tw: 答案正確

# Submission_CheatDetected
source: Cheat detection
de_de: Betrugserkennung
es_es: Detección de trampas
fr_fr: Détection de triche
id_id: Kecurangan terdeteksi
ja_jp: 不正検知
ko_kr: 부정 행위 감지됨
ru_ru: Обнаружение читов
vi_vn: Phát hiện gian lận
zh_tw: 作弊檢測

# Submission_FirstBlood
source: First blood
de_de: Erstes Blut
es_es: Primera sangre
fr_fr: Premier sang
ja_jp: ファーストブラッド
ru_ru: Первая кровь
zh_tw: 一血

# Submission_FlagSubmitted
source: Successfully submitted
de_de: Erfolgreich eingereicht
es_es: Enviado con éxito
fr_fr: Soumis avec succès
id_id: Berhasil dikirimkan
ja_jp: 提出完了
ko_kr: 제출 완료
ru_ru: Успешно отправлено
vi_vn: Nộp bài thành công
zh_tw: 成功提交

# Submission_NotFound
source: The submission was not found
de_de: Die Einreichung wurde nicht gefunden
es_es: La presentación no fue encontrada
fr_fr: La soumission n'a pas été trouvée
id_id: Submission tidak ditemukan
ja_jp: サブミッションは見つかりませんでした
ko_kr: 제출 실패
ru_ru: Отправление не найдено
vi_vn: Không tìm thấy bài nộp
zh_cn: 提交未找到
zh_tw: 提交未找到

# Submission_SecondBlood
source: Second blood
de_de: Zweite Blutflecken
es_es: Segunda sangre
fr_fr: Deuxième sang
ja_jp: セコンドブラッド
ru_ru: Вторая кровь
zh_tw: 二血

# Submission_ThirdBlood
source: Third blood
de_de: Dritte Blutflecken
es_es: Tercera sangre
fr_fr: Troisième sang
ja_jp: サードブラッド
ru_ru: Третья кровь
zh_tw: 三血

# Submission_UnknownInstance
source: Unknown instance
de_de: Unbekannte Instanz
es_es: Instancia desconocida
fr_fr: Instance inconnue
ja_jp: インスタンス不明
ko_kr: 알 수 없는 인스턴스
ru_ru: Неизвестный экземпляр
vi_vn: Instance không xác định
zh_tw: 實例未知

# Submission_WrongAnswer
source: Answer incorrect
de_de: FALSCH
es_es: INCORRECTO
fr_fr: FAUX
id_id: Jawaban salah
ja_jp: 間違い回答
ko_kr: 오답입니다
ru_ru: НЕВЕРНО
vi_vn: SAI
zh_tw: 答案錯誤
