Repository: GZTimeWalker/GZCTF
Catalog: src/GZCTF/Resources/Program.*.resx
Languages: de_de, es_es, fr_fr, id_id, ja_jp, ko_kr, ru_ru, vi_vn, zh_cn, zh_tw

# FlagChecker_AnswerRejected
source: [WA] Team [{0}] submitted answer [{2}] for challenge [{1}]
de_de: [WA] Team [{0}] hat die Antwort [{2}] für die Herausforderung [{1}] eingereicht
es_es: [WA] El equipo [{0}] presentó la respuesta [{2}] para el desafío [{1}]
fr_fr: [WA] Équipe [{0}] a soumis la réponse [{2}] pour le défi [{1}]
id_id: [WA] Tim [{0}] mengirim jawaban [{2}] untuk challenge [{1}]
ja_jp: [間違い回答] チーム [{0}] はチャレンジ [{1}] の回答 [{2}] を提出しました
ko_kr: [WA] [{0}] 팀이 [{1}] 문제 답으로 [{2}] 를 제출했습니다
ru_ru: [WA] Команда [{0}] предоставила неверный ответ [{2}] на задание [{1}]
vi_vn: [WA] Đội [{0}] đã nộp câu trả lời [{2}] cho thử thách [{1}].
zh_tw: [提交錯誤] 隊伍 [{0}] 提交題目 [{1}] 的答案 [{2}]

# FlagChecker_CheatDetected
source: [作弊检查] Team [{0}] suspected violation [{1}], related team [{2}]
de_de: [CHEAT] Team [{0}] hat das Flag von Team [{2}] in der Herausforderung [{1}] verwendet
es_es: [CHEAT] El equipo [{0}] usó la bandera del equipo [{2}] en el desafío [{1}]
fr_fr: [CHEAT] Équipe [{0}] a utilisé le drapeau de l'équipe [{2}] dans le défi [{1}]
id_id: [Kecurangan] Tim [{0}] menggunakan flag tim [{2}] di tantangan [{1}]
ja_jp: [不正検知] チーム [{0}] はルール [{1}] に違反の疑いがあります、関連チーム [{2}]
ko_kr: [CHEAT] [{0}] 팀이 [{1} 문제에 [{2}] 팀의 플래그를 제출했습니다
ru_ru: [CHEAT] Команда [{0}] использовала флаг команды [{2}] в задании [{1}]
vi_vn: [CHEAT] Đội [{0}] đã sử dụng flag của đội [{2}] trong thử thách [{1}].
zh_tw: [作弊檢查] 隊伍 [{0}] 疑似違規 [{1}]，相關隊伍 [{2}]

# FlagChecker_ConcurrencyFailed
source: [数据库并发] Failed to update commit #{0}
de_de: [KONKURRENZ] Status der Einreichung #{0} konnte nicht aktualisiert werden
es_es: [CONCURRENCY] Falló al actualizar el estado de la entrega #{0}
fr_fr: [CONCURRENCY] Échec de la mise à jour du statut de la soumission n°{0}
id_id: [CONCURRENCY] Gagal memperbarui status pengiriman #{0}
ja_jp: [データベースの同時実行性] サブミッション #{0} のステータスを更新できませんでした
ko_kr: [CONCURRENCY] #{0} 제출이 실패했습니다.
ru_ru: [CONCURRENCY] Не удалось обновить статус отправления #{0}
vi_vn: [CONCURRENCY] Không thể cập nhật trạng thái bài nộp #{0}.
zh_tw: [資料庫並發] 未能更新提交 #{0} 的狀態

# FlagChecker_UnknownInstance
source: [实例未知] No instance found for team [{0}] submission [{1}]
de_de: [UNBEKANNT] Keine Instanz für Team [{0}] in Challenge [{1}] gefunden
es_es: [UNKNOWN] No se encontró una instancia para el equipo [{0}] en el desafío [{1}]
fr_fr: [UNKNOWN] Aucune instance trouvée pour l'équipe [{0}] dans le défi [{1}]
id_id: [UNKNOWN] Tidak ada instance ditemukan untuk tim [{0}] di challenge [{1}]
ja_jp: [インスタンス不明] チーム [{0}] をチャレンジ [{1}] に提出したレコードが見つかりませんでした
ko_kr: [UNKNOWN] [{0}] 팀에 [{1}] 문제 인스턴스가 없습니다.
ru_ru: [UNKNOWN] Не найден экземпляр для команды [{0}] в задании [{1}]
vi_vn: [UNKNOWN] Không tìm thấy instance nào cho đội [{0}] trong thử thách [{1}].
zh_tw: [實例未知] 未找到隊伍 [{0}] 提交題目 [{1}] 的實例

# FlagsChecker_Recheck
source: Recheck {0} flags
de_de: Erneut {0} Flags überprüfen
es_es: Revisar {0} banderas
fr_fr: Revoir {0} drapeau
id_id: Periksa ulang flag {0}
ja_jp: {0} のフラッグを再度チェックします
ko_kr: 플래그 {0} 재확인
ru_ru: Перепроверка флагов: {0}
vi_vn: Kiểm tra lại {0} flags.
zh_cn: 重新开始检查 {0} 个 flag
zh_tw: 重新開始檢查 {0} 個 flag

# FlagsChecker_Started
source: Flag checker has been started
de_de: Flag-Checker wurde gestartet
es_es: El comprobador de banderas ha sido iniciado
fr_fr: Le vérificateur de drapeau a été démarré
id_id: Pemeriksaan flag telah dimulai
ja_jp: フラッグチェッカーが起動されました
ko_kr: 플래그 체커가 시작되었습니다.
ru_ru: Проверка флагов запущена
vi_vn: Hệ thống kiểm tra flag đã khởi động.
zh_cn: Flag 检查已启用
zh_tw: Flag 檢查已啟用

# FlagsChecker_Stopped
source: Flag checker has been stopped
de_de: Flag-Checker wurde gestoppt
es_es: El comprobador de banderas ha sido detenido
fr_fr: Le vérificateur de drapeaux a été arrêté
id_id: Pemeriksa flag telah dihentikan
ja_jp: フラッグチェッカーが停止されました
ko_kr: 플래그 체커가 중단되었습니다.
ru_ru: Проверка флагов приостановлена
vi_vn: Hệ thống kiểm tra flag đã dừng.
zh_cn: Flag 检查已停止
zh_tw: Flag 檢查已停止

# FlagsChecker_WorkerCancelled
source: Checking task was cancelled, checker worker #{0} is about to stop
de_de: Überprüfung wurde abgebrochen, Checker-Arbeiter #{0} wird gestoppt
es_es: La tarea de comprobación fue cancelada, el trabajador del comprobador #{0} está a punto de detenerse
fr_fr: La tâche de vérification a été annulée, le travailleur du vérificateur #{0} est sur le point de s'arrêter
id_id: Tugas pemeriksaan dibatalkan, worker pemeriksa #{0} akan berhenti
ja_jp: タスクがキャンセルされたため、チェッカー ワーカー #{0} を停止します
ko_kr: #{0} 이 중단되어 검사 작업이 중단되었습니다.
ru_ru: Проверка отменена, контроллер флагов #{0} останавливается
vi_vn: Nhiệm vụ kiểm tra bị hủy, worker #{0} sẽ dừng.
zh_cn: 任务取消，检查线程 #{0} 将退出
zh_tw: 任務取消，檢查線程 #{0} 將退出

# FlagsChecker_WorkerExceptionOccurred
source: Checker worker #{0} encountered an exception
de_de: Checker-Arbeiter #{0} hat eine Ausnahme festgestellt
es_es: El trabajador del comprobador #{0} encontró una excepción
fr_fr: Le travailleur du vérificateur #{0} a rencontré une exception
id_id: Worker pemeriksa #{0} mengalami pengecualian
ja_jp: チェッカー ワーカー #{0} に例外が発生しました
ko_kr: 검사기 #{0} 에서 오류가 발생했습니다.
ru_ru: Контроллер флагов #{0}: произошла ошибка
vi_vn: Worker #{0} gặp lỗi.
zh_cn: 检查线程 #{0} 发生异常
zh_tw: 檢查線程 #{0} 發生異常

# FlagsChecker_WorkerStarted
source: Checker worker #{0} has been started
de_de: Checker-Arbeiter #{0} wurde gestartet
es_es: El trabajador del comprobador #{0} ha sido iniciado
fr_fr: Le travailleur du vérificateur #{0} a été démarré
id_id: Worker pemeriksa #{0} telah dimulai
ja_jp: チェッカー ワーカー #{0} が起動されました
ko_kr: 검사기 #{0} 이 시작되었습니다.
ru_ru: Контроллер флагов #{0} запущен
vi_vn: Worker #{0} đã khởi động.
zh_cn: 检查线程 #{0} 已启动
zh_tw: 檢查線程 #{0} 已啟動

# FlagsChecker_WorkerStartProcessing
source: Checker worker #{0} starts to process submission: {1}
de_de: Prüfer-Arbeiter #{0} beginnt mit der Bearbeitung der Einreichung: {1}
es_es: El trabajador de verificación #{0} comienza a procesar la entrega: {1}
fr_fr: Le travailleur du vérificateur #{0} commence à traiter la soumission : {1}
id_id: Worker pemeriksa #{0} mulai memproses pengiriman: {1}
ja_jp: チェッカー ワーカー #{0} はサブミッション {1} をチェックしています
ko_kr: 검사기 #{0} 가 {1} 제출을 검사하고 있습니다.
ru_ru: Контроллер флагов #{0} начинает проверку отправления: {1}
vi_vn: Worker #{0} bắt đầu xử lý bài nộp: {1}.
zh_cn: 检查线程 #{0} 开始处理提交：{1}
zh_tw: 檢查線程 #{0} 開始處理提交：{1}

# FlagsChecker_WorkerStopped
source: Checker worker #{0} has been stopped
de_de: Prüfer-Arbeiter #{0} wurde gestoppt
es_es: El trabajador de verificación #{0} ha sido detenido
fr_fr: Le travailleur du vérificateur #{0} a été arrêté
id_id: Worker pemeriksa #{0} telah dihentikan
ja_jp: チェッカー ワーカー #{0} が停止されました
ko_kr: 검사기 #{0} 가 중단되었습니다.
ru_ru: Контроллер флагов #{0} остановлен
vi_vn: Worker #{0} đã dừng.
zh_cn: 检查线程 #{0} 已退出
zh_tw: 檢查線程 #{0} 已退出

# GameRepository_GameDeletionChallenges
source: Cleaning up {1} challenge attachments for game {0}...
de_de: Bereinige {1} Herausforderungsspeicher für Spiel {0}...
es_es: Limpiando {1} archivos adjuntos de desafíos para el juego {0}...
fr_fr: Nettoyage de {1} pièces jointes de défis pour le jeu {0}...
id_id: Membersihkan {1} lampiran challenge untuk game {0}...
ja_jp: ゲーム {0} での {1} 個のチャレンジに関するファイルを削除しています...
ko_kr: 게임 {0} 의 {1} 문제 인스턴스 삭제 중..
ru_ru: Очистка вложений ({1}) для игры {0}...
vi_vn: Đang xóa {1} tệp đính kèm thử thách cho trò chơi {0}...
zh_tw: 正在清理比賽 {0} 的 {1} 個題目的相關附件……

# Game_DeletionFailed
source: Failed to delete game, related files may have been corrupted, please try again
de_de: Fehler beim Löschen des Spiels, verwandte Dateien könnten beschädigt sein, bitte versuchen Sie es erneut
es_es: No se pudo eliminar el juego, los archivos relacionados pueden haberse dañado, por favor intente de nuevo
fr_fr: Échec de la suppression du jeu, les fichiers associés peuvent avoir été corrompus, veuillez réessayer
id_id: Gagal menghapus game, file terkait mungkin telah korup, silakan coba lagi
ja_jp: ゲームを削除できませんでした。関連ファイルが破損している可能性があります。再試行してください。
ko_kr: 게임 삭제 실패. 관련 파일이 손상되었습니다.
ru_ru: Не удалось удалить игру, связанные файлы могли быть повреждены. Пожалуйста, попробуйте снова
vi_vn: Không thể xóa trò chơi, tệp liên quan có thể đã bị lỗi.
zh_tw: 刪除比賽失敗，相關文件可能已受損，請重新刪除

# GameRepository_GameDeletionTeams
source: Cleaning up {1} team files for game {0}...
de_de: Bereinige {1} Teamdateien für Spiel {0}...
es_es: Limpiando {1} archivos de equipos para el juego {0}...
fr_fr: Nettoyage des fichiers de l'équipe {1} pour le jeu {0}...
id_id: Membersihkan file tim {1} untuk game {0}...
ja_jp: ゲーム {0} での {1} 個のチームに関するファイルを削除しています...
ko_kr: {1} 팀의 {0} 게임 정보 삭제 중...
ru_ru: Очистка файлов команд ({1}) для игры {0}...
vi_vn: Đang xóa {1} tệp của đội trong trò chơi {0}...
zh_tw: 正在清理比賽 {0} 的 {1} 個隊伍相關文件……

# GameRepository_XorKeyNotConfigured
source: The different or key in the configuration file is not set and the match key will be stored explicitly in the database.
de_de: Der XOR-Schlüssel in der Konfigurationsdatei ist nicht festgelegt und der Wettbewerbsschlüssel wird explizit in der Datenbank gespeichert.
es_es: La clave XOR en el archivo de configuración no está configurada y la clave de competencia se almacenará explícitamente en la base de datos.
fr_fr: La clé XOR dans le fichier de configuration n'est pas définie et la clé de compétition sera stockée explicitement dans la base de données.
id_id: Kunci XOR dalam file konfigurasi tidak diatur dan kunci kompetisi akan disimpan secara eksplisit di dalam basis data.
ja_jp: 設定ファイルの XOR キーが指定されていません。ゲームキーはデータベースに暗号化せず保存します。
ko_kr: 설정 파일에 XOR 키가 없어 게임 키가 그대로 데이터베이스에 저장됩니다.
ru_ru: Ключ XOR в конфигурационном файле не задан и ключ игры будет сохранен в базе данных в открытом виде.
vi_vn: Chưa đặt XOR key trong tệp cấu hình, khóa trò chơi sẽ được lưu trong cơ sở dữ liệu.
zh_tw: 配置文件中的異或密鑰未設置，比賽私鑰將會被明文存儲至資料庫。

# Game_CannotLeaveAfterApproval
source: Can not exit the game after entrance approval
de_de: Das Spiel kann nach Genehmigung des Eintritts nicht verlassen werden
es_es: No se puede salir del juego después de la aprobación de la entrada
fr_fr: Impossible de quitter le jeu après approbation de l'entrée
id_id: Tidak bisa keluar dari game setelah persetujuan masuk
ja_jp: 参加承認後はゲームから抜けられません
ko_kr: 입장 승인 후 게임을 종료할 수 없습니다
ru_ru: Нельзя выйти из игры после одобрения заявки на участие
vi_vn: Không thể rời trò chơi sau khi đã được phê duyệt tham gia.
zh_cn: 审核通过后无法退出比赛
zh_tw: 審核通過後無法退出比賽

# Game_CannotLeaveWithoutJoin
source: Can not exit the game you are not joining
de_de: Kann das Spiel, dem du nicht beitrittst, nicht verlassen
es_es: No se puede salir del juego al que no te has unido
fr_fr: Impossible de quitter le jeu que vous n'avez pas rejoint
id_id: Tidak bisa keluar dari game karena kamu tidak bergabung
ja_jp: 未参加のゲームから抜けられません
ko_kr: 참가하지 않은 상태에서 게임을 종료할 수 없습니다.
ru_ru: Вы не можете выйти из игры, к которой не присоединились
vi_vn: Không thể rời trò chơi mà bạn chưa tham gia.
zh_cn: 无法退出未报名的比赛
zh_tw: 無法退出未報名的比賽

# Game_CaptureNotFound
source: No captured traffic found
de_de: Kein erfasster Datenverkehr gefunden
es_es: No se encontró tráfico capturado
fr_fr: Aucun trafic capturé trouvé
id_id: Tidak ada traffic yang tertangkap
ja_jp: 該当のキャプチャが見つかりませんでした
ko_kr: 캡처된 트래픽이 없습니다.
ru_ru: Захваченный трафик не найден
vi_vn: Không tìm thấy lưu lượng được ghi lại.
zh_tw: 未找到相關捕獲信息

# Game_ChallengeNotFound
source: Title not found or dynamic attachment allocation failed
de_de: Herausforderung nicht gefunden oder dynamische Anhangszuteilung fehlgeschlagen
es_es: Desafío no encontrado o asignación de adjunto dinámico fallida
fr_fr: Défi non trouvé ou échec de l'allocation dynamique de pièce jointe
id_id: Challenge tidak ditemukan atau alokasi lampiran dinamis gagal
ja_jp: チャレンジは見つかりませんでしたか、または動的添付ファイルを割り当てられませんでした。
ko_kr: 문제를 찾을 수 없거나 동적 인스턴스 할당에 실패했습니다
ru_ru: Задание не найдено или не удалось распределить динамические вложения
vi_vn: Không tìm thấy thử thách hoặc phân bổ tệp động thất bại.
zh_tw: 題目未找到或動態附件分配失敗

# Game_ContainerAlreadyCreated
source: The problem has been created container
de_de: Der Container dieser Herausforderung existiert bereits
es_es: El contenedor de este desafío ya existe
fr_fr: Le conteneur de ce défi existe déjà
id_id: Container untuk challenge ini sudah ada
ja_jp: このチャレンジにはすでにコンテナを作成しました
ko_kr: 해당 문제의 컨테이너가 이미 존재합니다.
ru_ru: Контейнер для этого задания уже существует
vi_vn: Container của thử thách này đã tồn tại.
zh_tw: 題目已經創建容器

# Game_ContainerCreationFailed
source: Problem creating container failed
de_de: Container für Herausforderung konnte nicht erstellt werden
es_es: Fallo al crear contenedor para el desafío
fr_fr: Échec de la création du conteneur pour le défi
id_id: Gagal membuat container untuk challenge
ja_jp: チャレンジのコンテナを作成できませんでした
ko_kr: 해당 문제의 컨테이너 생성 실패
ru_ru: Не удалось создать контейнер для задания
vi_vn: Không thể tạo container cho thử thách.
zh_tw: 題目創建容器失敗

# Game_ContainerCreationNotAllowed
source: The title cannot create a container
de_de: Der Titel kann keinen Container erstellen
es_es: El título no puede crear un contenedor
fr_fr: Le titre ne peut pas créer un conteneur
id_id: Tantangan ini tidak dapat membuat wadah
ja_jp: このチャレンジはコンテナの作成はできません
ko_kr: 해당 제목의 컨테이너 생성 실패
ru_ru: У этого задания нет контейнеров, создание невозможно
vi_vn: Thử thách này không thể tạo container.
zh_tw: 題目不可創建容器

# Game_ContainerDeleted
source: {0} destroyed container instance of problem {1} [{2}]
de_de: {0} hat den Container [{2}] der Herausforderung {1} zerstört
es_es: {0} ha destruido el contenedor [{2}] del desafío {1}
fr_fr: {0} a détruit le conteneur [{2}] du défi {1}
id_id: {0} telah menghapus container [{2}] dari tantangan {1}
ja_jp: {0} はチャレンジ {1} のコンテナインスタンス [{2}] を破棄しました
ko_kr: {0} 의 문제 {1} 컨테이너 [{2}]가 삭제되었습니다.
ru_ru: Команда {0} уничтожила контейнер [{2}] из задания {1}
vi_vn: {0} đã xóa container [{2}] của thử thách {1}
zh_tw: {0} 銷毀題目 {1} 的容器實例 [{2}]

# Game_ContainerDeletionFailed
source: Problem deleting container failed
de_de: Löschen des Containers für Herausforderung fehlgeschlagen
es_es: Fallo al eliminar el contenedor del desafío
fr_fr: Échec de la suppression du conteneur pour le défi
id_id: Gagal menghapus container untuk challenge
ja_jp: チャレンジのコンテナを削除できませんでした
ko_kr: 해당 문제의 컨테이너 삭제 실패
ru_ru: Не удалось уничтожить контейнер для задания
vi_vn: Không thể xóa container của thử thách
zh_tw: 題目刪除容器失敗

# Game_ContainerNotCreated
source: No container created for the problem
de_de: Der Container dieser Herausforderung wurde nicht erstellt
es_es: El contenedor de este desafío no ha sido creado
fr_fr: Le conteneur de ce défi n'a pas été créé
id_id: Container untuk tantangan ini belum dibuat
ja_jp: このチャレンジのコンテナはまだ作成されていません
ko_kr: 해당 문제의 컨테이너가 생성되지 않았습니다.
ru_ru: Контейнер для этого задания ещё не создан
vi_vn: Container của thử thách này chưa được tạo
zh_tw: 題目未創建容器

# Game_ContainerNumberLimitExceeded
source: The number of team containers cannot exceed {0}
de_de: Die Anzahl der Team-Container darf {0} nicht überschreiten
es_es: El número de contenedores de equipo no puede exceder de {0}
fr_fr: Le nombre de conteneurs d'équipe ne peut pas dépasser {0}
id_id: Jumlah container tim tidak boleh melebihi {0}
ja_jp: チームコンテナの数は {0} を超えることはできません
ko_kr: 팀 컨테이너의 수는 {0}을 초과할 수 없습니다
ru_ru: Количество контейнеров команды не может превышать {0}
vi_vn: Số lượng container của đội không thể vượt quá {0}
zh_tw: 隊伍容器數目不能超過 {0}

# Game_DeadlineExpired
source: Submission due date has passed
de_de: Der Abgabetermin ist abgelaufen
es_es: La fecha límite de presentación ha pasado
fr_fr: La date limite de soumission est passée
id_id: Batas waktu pengumpulan sudah lewat
ja_jp: 提出期限が過ぎました
ko_kr: 제출 기간이 지났습니다.
ru_ru: Срок сдачи вышел
vi_vn: Đã hết hạn nộp
zh_tw: 提交截止時間已過

# Game_InOtherTeam
source: You have joined the game from other team
de_de: Du hast dich von einem anderen Team aus dem Spiel angeschlossen
es_es: Te has unido al juego desde otro equipo
fr_fr: Vous avez rejoint le jeu à partir d'une autre équipe
id_id: Anda telah bergabung kedalam game dari tim lain
ja_jp: すでに別のゲームに参加しています
ko_kr: 이미 다른 팀에 가입되어있습니다.
ru_ru: Вы уже присоединились к игре от другой команды
vi_vn: Bạn đã tham gia trò chơi từ một đội khác
zh_cn: 您已经在其他队伍报名参赛
zh_tw: 您已經在其他隊伍報名參賽

# Game_InvalidInvitationCode
source: Invalid game invitation code
de_de: Ungültiger Spieleinladungscode
es_es: Código de invitación al juego no válido
fr_fr: Code d'invitation au jeu invalide
id_id: Kode undangan tidak valid
ja_jp: 無効なゲーム招待コード
ko_kr: 초대 코드가 유효하지 않습니다.
ru_ru: Неверный код приглашения
vi_vn: Mã mời tham gia trò chơi không hợp lệ
zh_cn: 比赛邀请码错误
zh_tw: 比賽邀請碼錯誤

# Game_InvalidOrganization
source: Invalid organization
ja_jp: 無効な参戦組織
zh_cn: 无效的参赛单位

# Game_JoinSucceeded
source: {0} has successfully joined game {1}
de_de: {0} hat erfolgreich am Spiel {1} teilgenommen
es_es: {0} se ha unido con éxito al juego {1}
fr_fr: {0} a rejoint avec succès le jeu {1}
id_id: {0} telah berhasil bergabung kedalam game {1}
ja_jp: {0} はゲーム {1} に正常に参加しました
ko_kr: {0} 이 성공적으로 {1} 게임에 참여하였습니다.
ru_ru: Команда {0} присоединилась к игре {1}
vi_vn: {0} đã tham gia thành công trò chơi {1}
zh_cn: {0} 成功报名了比赛 {1}
zh_tw: {0} 成功報名了比賽 {1}

# Game_NotFound
source: The game was not found
de_de: Das Spiel wurde nicht gefunden
es_es: El juego no fue encontrado
fr_fr: Le jeu n'a pas été trouvé
id_id: Game tidak ditemukan
ja_jp: ゲームは見つかりませんでした
ko_kr: 게임을 찾을 수 없습니다.
ru_ru: Игра не найдена
vi_vn: Không tìm thấy trò chơi
zh_cn: 比赛未找到
zh_tw: 比賽未找到

# Game_NotMemberOfTeam
source: You are not a member of the team
de_de: Du bist kein Mitglied des Teams
es_es: No eres miembro del equipo
fr_fr: Vous n'êtes pas membre de l'équipe
id_id: Anda bukan anggota tim
ja_jp: このチームのメンバーではありません
ko_kr: 해당 팀원이 아닙니다.
ru_ru: Вы не являетесь участником команды
vi_vn: Bạn không phải là thành viên của đội
zh_cn: 您不是此队伍的队员
zh_tw: 您不是此隊伍的隊員

# Game_NotParticipated
source: You have not participated in the game
de_de: Sie haben nicht am Spiel teilgenommen
es_es: No has participado en el juego
fr_fr: Vous n'avez pas participé au jeu
id_id: Kamu belum berpartisipasi dalam game
ja_jp: ゲームに参加していません
ko_kr: 해당 게임에 참여하지 않았습니다.
ru_ru: Вы не участвовали в этой игре
vi_vn: Bạn chưa tham gia trò chơi này
zh_tw: 您尚未參賽

# Game_NotStarted
source: The game has not started
de_de: Das Spiel hat nicht begonnen
es_es: El juego no ha comenzado
fr_fr: Le jeu n'a pas commencé
id_id: Game belum dimulai
ja_jp: ゲームはまだ開始されていません
ko_kr: 게임이 시작되었습니다.
ru_ru: Игра ещё не началась
vi_vn: Trò chơi chưa bắt đầu
zh_cn: 比赛未开始
zh_tw: 比賽未開始

# Game_OperationTooFrequent
source: Container operation too often
de_de: Containeroperation zu häufig
es_es: Operación de contenedor demasiado frecuente
fr_fr: Opération du conteneur trop fréquente
id_id: Terlalu sering pengoperasian container
ja_jp: コンテナ操作の試行が多すぎます
ko_kr: 컨테이너가 바쁩니다.
ru_ru: Слишком частые операции над контейнерами
vi_vn: Thao tác quá thường xuyên
zh_tw: 容器操作過於頻繁

# Game_ParticipationNotAccepted
source: Your entry request has not been passed or banned
de_de: Ihre Registrierung wurde abgelehnt oder gesperrt
es_es: Tu registro ha sido rechazado o prohibido
fr_fr: Votre inscription a été rejetée ou bannie
id_id: Pendaftaranmu telah ditolak atau dibanned
ja_jp: あなたの参加申請はまだ承認されていませんか、または参加制限が課さられています。
ko_kr: 당신의 가입이 거부되었거나 금지되었습니다!
ru_ru: Ваша регистрация была отклонена или заблокирована
vi_vn: Đăng ký của bạn đã bị từ chối hoặc cấm
zh_tw: 您的參賽申請尚未通過或被禁賽

# Game_ScoreboardDownloadFailed
source: Failed to download scoreboard
de_de: Der Download der Bestenliste ist fehlgeschlagen
es_es: Error al descargar el marcador
fr_fr: Échec du téléchargement du tableau des scores
id_id: Gagal mengunduh scoreboard
ja_jp: ランキングダウンロードに失敗しました
ko_kr: 스코어보드 다운 실패
ru_ru: Не удалось загрузить рейтинговую таблицу
vi_vn: Không tải được bảng điểm
zh_tw: 積分榜下載失敗

# Game_SubmissionNotFound
source: The submission was not found
de_de: Die Einreichung wurde nicht gefunden
es_es: No se encontró la presentación
fr_fr: La soumission n'a pas été trouvée
id_id: Submission tidak ditemukan
ja_jp: 提出は見つかりませんでした
ko_kr: 제출된 것이 없습니다.
ru_ru: Отправление не найдено
vi_vn: Không tìm thấy bài nộp
zh_tw: 提交未找到

# Game_TeamMemberLimitExceeded
source: The number of participants in the team exceeds the limit
de_de: Die Anzahl der Teammitglieder überschreitet das Limit
es_es: El número de participantes en el equipo excede el límite
fr_fr: Le nombre de participants dans l'équipe dépasse la limite
id_id: Jumlah peserta dalam tim melebihi batas
ja_jp: チームの参加者数が制限を超えています
ko_kr: 팀원 수가 최대에 도달했습니다.
ru_ru: Количество участников в команде превышает ограничение
vi_vn: Số lượng thành viên trong đội vượt giới hạn
zh_cn: 队伍参与人数超过比赛限制
zh_tw: 隊伍參與人數超過比賽限制

# Game_WriteupSubmitted
source: {0} successfully submitted {1} Write-Up
de_de: {0} hat erfolgreich {1} Write-Up eingereicht
es_es: {0} ha enviado exitosamente {1} Write-Up
fr_fr: {0} a soumis avec succès {1} Write-Up
id_id: {0} berhasil mengirim Write-Up {1}
ja_jp: {0} は {1} の記事を正常に提出しました
ko_kr: {0} 팀 {1} 풀이 제출 완료.
ru_ru: Команда {0} отправила отчет на {1}
vi_vn: {0} đã gửi thành công {1} Write-Up
zh_tw: {0} 成功提交 {1} 的 Writeup

# Header_Captain
source: Captain
de_de: Kapitän
es_es: Capitán
fr_fr: Capitaine
id_id: Kapten
ja_jp: リーダー
ko_kr: 팀장
ru_ru: Капитан
vi_vn: Đội trưởng
zh_tw: 隊長

# Header_Challenge
source: Challenge
de_de: Herausf.
es_es: Desafío
fr_fr: Défi
ja_jp: チャレンジ
ko_kr: 문제
ru_ru: Задание
vi_vn: Thử thách
zh_tw: 題目

# Header_Email
source: User email
de_de: E-Mail
es_es: Correo electrónico
fr_fr: Email
id_id: Email
ja_jp: メール
ko_kr: Email
ru_ru: Электронная почта
vi_vn: Email
zh_tw: 用戶郵箱

# Header_Member
source: Crew
es_es: Equipo
fr_fr: Équipage
id_id: Anggota
ja_jp: メンバー
ko_kr: 팀원
ru_ru: Участник
vi_vn: Nhóm
zh_tw: 隊員

# Header_PhoneNumber
source: Phone number
de_de: Telefon
es_es: Teléfono
fr_fr: Téléphone
id_id: Nomor Handphone
ja_jp: 電話番号
ko_kr: 전화번호
ru_ru: Телефон
vi_vn: Số điện thoại
zh_tw: 手機號

# Header_Ranking
source: Rank
de_de: Rang
es_es: Rango
fr_fr: Rang
id_id: Ranking
ja_jp: 順位
ko_kr: 순위
ru_ru: Место
vi_vn: Xếp hạng
zh_tw: 排名

# Header_ScoringTime
source: Scoring time
de_de: Zeit
es_es: Tiempo
fr_fr: Temps
id_id: Waktu
ja_jp: 得点日時
ko_kr: 시각
ru_ru: Время
vi_vn: Thời gian
zh_tw: 得分時間

# Header_SolvedNumber
source: Solved
de_de: Gelöst
es_es: Resuelto
fr_fr: Résolu
ja_jp: 解問題数
ru_ru: Решений
vi_vn: Đã giải quyết
zh_tw: 解題數量

# Header_StdNumber
source: Student number
de_de: Matrikelnummer
es_es: Número de estudiante
fr_fr: Numéro d'étudiant
id_id: Nomor siswa
ja_jp: ID 番号
ko_kr: 학번
ru_ru: СтудБилет
vi_vn: Mã số sinh viên
zh_tw: 學號

# Header_SubmitContent
source: Submission content
de_de: Eingabe
es_es: Envío
fr_fr: Soumission
id_id: Submission
ja_jp: 提出内容
ko_kr: 제출
ru_ru: Флаг
vi_vn: Các bài nộp
zh_tw: 提交內容

# Header_SubmitStatus
source: Submission status
de_de: Status
es_es: Estado
fr_fr: Statut
id_id: Status
ja_jp: 提出状態
ko_kr: 상태
ru_ru: Статус
vi_vn: Trạng thái
zh_tw: 提交狀態

# Header_SubmitTime
source: Submitted time
de_de: Zeit
es_es: Tiempo
fr_fr: Temps
id_id: Waktu
ja_jp: 提出日時
ko_kr: 제출 시각
ru_ru: Время
vi_vn: Thời gian nộp
zh_tw: 提交時間

# Header_Team
source: Team
es_es: Equipo
fr_fr: Équipe
id_id: Tim
ja_jp: チーム
ko_kr: 팀
ru_ru: Команда
vi_vn: Đội
zh_tw: 戰隊

# Header_TotalScore
source: Score
de_de: Punkte
es_es: Puntuación
id_id: Skor
ja_jp: 合計得点
ko_kr: 점수
ru_ru: Счет
vi_vn: Điểm số
zh_tw: 總分

# Header_User
source: User
de_de: Benutzer
es_es: Usuario
fr_fr: Utilisateur
id_id: Pengguna
ja_jp: ユーザー
ko_kr: 사용자
ru_ru: Игрок
vi_vn: Người dùng
zh_tw: 用戶
