Repository: GZTimeWalker/GZCTF
Catalog: src/GZCTF/Resources/Program.*.resx
Languages: de_de, es_es, fr_fr, id_id, ja_jp, ko_kr, ru_ru, vi_vn, zh_cn, zh_tw

# Identity_ConcurrencyFailure
source: Concurrent error occurred, please try again later
de_de: Ein gleichzeitiger Fehler ist aufgetreten, bitte versuchen Sie es später erneut
es_es: Ocurrió un error concurrente, por favor intente de nuevo más tarde
fr_fr: Une erreur de simultanéité s'est produite, veuillez réessayer plus tard
id_id: Terjadi kesalahan Concurrent, silakan coba lagi nanti
ja_jp: 同時実行中にエラーが発生しました。後でもう一度試してください。
ko_kr: 오류 발생, 다시 시도해주세요.
ru_ru: Произошла ошибка многозадачности. Пожалуйста, попробуйте позже
vi_vn: Hệ thống gặp lỗi đồng thời, vui lòng thử lại sau
zh_tw: 發生並發錯誤，請稍後再試

# Identity_DefaultError
source: An error has occurred. Please try again later.
de_de: Ein Fehler ist aufgetreten. Bitte versuchen Sie es später noch einmal.
es_es: Ha ocurrido un error. Por favor intente de nuevo más tarde.
fr_fr: Une erreur est survenue. Veuillez réessayer plus tard.
id_id: Terjadi kesalahan, silakan coba lagi nanti.
ja_jp: エラー発生しました。しばらくしてからもう一度お試しください。
ko_kr: 오류 발생, 다시 시도해주세요.
ru_ru: Произошла ошибка. Пожалуйста, попробуйте позже.
vi_vn: Lỗi không xác định, vui lòng thử lại sau.
zh_tw: 發生錯誤，請稍後再試

# Identity_DuplicateEmail
source: Email address {0} already exists
de_de: E-Mail-Adresse {0} existiert bereits
es_es: La dirección de correo electrónico {0} ya existe
fr_fr: L'adresse e-mail {0} existe déjà
id_id: Alamat email {0} telah terdaftar
ja_jp: メールアドレス {0} はすでに存在しています
ko_kr: {0} 은 이미 사용 중인 이메일입니다.
ru_ru: Почта {0} уже зарегистрирована
vi_vn: Địa chỉ email {0} đã tồn tại
zh_tw: 郵箱地址 {0} 已存在

# Identity_DuplicateRoleName
source: Role name {0} already exists
de_de: Rollenname {0} existiert bereits
es_es: El nombre del rol {0} ya existe
fr_fr: Le nom de rôle {0} existe déjà
id_id: Role name {0} telah terdaftar
ja_jp: ロール名 {0} は既に存在しています
ko_kr: {0} 은 이미 사용된 역할입니다.
ru_ru: Роль {0} уже существует
vi_vn: Tên vai trò {0} đã tồn tại
zh_tw: 角色名 {0} 已存在

# Identity_DuplicateUserName
source: Username {0} already exists
de_de: Benutzername {0} existiert bereits
es_es: El nombre de usuario {0} ya existe
fr_fr: Le nom d'utilisateur {0} existe déjà
id_id: Nama pengguna {0} telah terdaftar
ja_jp: ユーザー名 {0} は既に使用されています
ko_kr: {0} 은 이미 사용 중인 이름입니다.
ru_ru: Пользователь {0} уже существует
vi_vn: Tên người dùng {0} đã tồn tại
zh_tw: 用戶名 {0} 已存在

# Identity_InvalidEmail
source: Email address {0} is invalid
de_de: E-Mail-Adresse {0} ist ungültig
es_es: La dirección de correo electrónico {0} es inválida
fr_fr: L'adresse e-mail {0} est invalide
id_id: Alamat email {0} tidak valid
ja_jp: メールアドレス {0} は無効です
ko_kr: {0} 은 유효하지 않은 이메일입니다.
ru_ru: Адрес электронной почты {0} недопустим
vi_vn: Địa chỉ email {0} không hợp lệ
zh_tw: 郵箱地址 {0} 無效

# Identity_InvalidRoleName
source: Role name {0} is invalid
de_de: Rollenname {0} ist ungültig
es_es: El nombre del rol {0} es inválido
fr_fr: Le nom de rôle {0} est invalide
id_id: Role name {0} tidak valid
ja_jp: 無効なロール {0}
ko_kr: {0} 은 유효하지 않은 역할입니다.
ru_ru: Роль {0} недопустима
vi_vn: Tên vai trò {0} không hợp lệ
zh_tw: 角色名 {0} 無效

# Identity_InvalidToken
source: Invalid verification code
de_de: Ungültiger Bestätigungscode
es_es: Código de verificación inválido
fr_fr: Code de vérification invalide
id_id: Kode verifikasi tidak valid
ja_jp: 無効な認証コード
ko_kr: 인증 코드 오류
ru_ru: Неверный код подтверждения
vi_vn: Mã xác thực không hợp lệ
zh_tw: 驗證碼無效

# Identity_InvalidUserName
source: Invalid username {0}
de_de: Ungültiger Benutzername {0}
es_es: Nombre de usuario {0} inválido
fr_fr: Nom d'utilisateur invalide {0}
id_id: Nama pengguna {0} tidak valid
ja_jp: 無効なユーザー名 {0}
ko_kr: {0} 은 유효하지 않은 이름입니다.
ru_ru: Неверное имя пользователя {0}
vi_vn: Tên người dùng {0} không hợp lệ
zh_tw: 用戶名 {0} 無效

# Identity_LoginAlreadyAssociated
source: Login already associated
de_de: Login bereits zugeordnet
es_es: Inicio de sesión ya asociado
fr_fr: Connexion déjà associée
id_id: Login sudah terhubung
ja_jp: ログインはすでにリンクされました
ko_kr: 이미 로그인되었습니다.
ru_ru: Логин уже ассоциирован
vi_vn: Tài khoản này đã được liên kết với một người dùng khác
zh_tw: 登錄已經關聯

# Identity_PasswordMismatch
source: Wrong password entered
de_de: Falsches Passwort eingegeben
es_es: Contraseña incorrecta ingresada
fr_fr: Mot de passe incorrect entré
id_id: Kata sandi yang dimasukkan salah
ja_jp: パスワードが正しくありません
ko_kr: 비밀번호가 일치하지 않습니다.
ru_ru: Неверный пароль
vi_vn: Mật khẩu bạn nhập không chính xác.
zh_tw: 密碼輸入錯誤

# Identity_PasswordRequiresDigit
source: Password requires digits
de_de: Passwort erfordert Ziffern
es_es: La contraseña requiere dígitos
fr_fr: Le mot de passe nécessite des chiffres
id_id: Kata sandi harus mengandung angka
ja_jp: パスワードは、数字を含める必要があります。
ko_kr: 비밀번호에는 숫자가 포함되어야 합니다.
ru_ru: Пароль должен содержать цифры
vi_vn: Mật khẩu cần ít nhất một ký tự số (0-9).
zh_tw: 密碼中需要數字

# Identity_PasswordRequiresLower
source: Password requires lowercase letters
de_de: Passwort erfordert Kleinbuchstaben
es_es: La contraseña requiere letras minúsculas
fr_fr: Le mot de passe nécessite des lettres minuscules
id_id: Kata sandi harus mengandung huruf kecil
ja_jp: パスワードは、小文字を含める必要があります。
ko_kr: 비밀번호에는 소문자가 포함되어야 합니다.
ru_ru: Пароль должен содержать строчные буквы
vi_vn: Mật khẩu cần ít nhất một ký tự chữ thường (a-z).
zh_tw: 密碼中需要小寫字母

# Identity_PasswordRequiresNonAlphanumeric
source: Password requires symbols
de_de: Passwort erfordert Symbole
es_es: La contraseña requiere símbolos
fr_fr: Le mot de passe nécessite des symboles
id_id: Kata sandi harus mengandung simbol
ja_jp: パスワードは、記号を含める必要があります。
ko_kr: 비밀번호에는 특수문자가 포함되어야 합니다.
ru_ru: Пароль должен содержать спецсимволы
vi_vn: Mật khẩu cần ít nhất một ký tự đặc biệt (!, @, #,...).
zh_tw: 密碼中需要符號

# Identity_PasswordRequiresUniqueChars
source: The password needs at least {0} different characters
de_de: Das Passwort benötigt mindestens {0} verschiedene Zeichen
es_es: La contraseña necesita al menos {0} personajes diferentes
fr_fr: Le mot de passe a besoin d'au moins {0} caractères différents
id_id: Kata sandi perlu setidaknya {0} karakter yang berbeda
ja_jp: パスワードは、少なくとも {0} 文字が必要となります。
ko_kr: 비밀번호에 최소 {0} 개 다른 문자가 있어야 합니다.
ru_ru: Пароль должен содержать не менее {0} различных символов
vi_vn: Mật khẩu cần có ít nhất {0} ký tự khác nhau
zh_tw: 密碼中至少需要 {0} 種不同的字符

# Identity_PasswordRequiresUpper
source: Password requires uppercase letters
de_de: Passwort erfordert Großbuchstaben
es_es: La contraseña requiere letras mayúsculas
fr_fr: Le mot de passe nécessite des lettres majuscules
ja_jp: パスワードは、大文字を含める必要があります。
ko_kr: 비밀번호에는 대문자가 포함되어야 합니다.
ru_ru: Пароль должен содержать заглавные буквы
vi_vn: Mật khẩu cần ít nhất một ký tự chữ in hoa (A-Z).
zh_tw: 密碼中需要大寫字母

# Identity_PasswordTooShort
source: Password length {0} is too short
de_de: Passwortlänge {0} ist zu kurz
es_es: La longitud de la contraseña {0} es demasiado corta
fr_fr: La longueur du mot de passe {0} est trop courte
id_id: Panjang kata sandi {0} terlalu pendek
ja_jp: パスワードの長さ {0} が短すぎます。
ko_kr: 비밀번호 길이 {0} 가 너무 짧습니다.
ru_ru: Недостаточная длина пароля ({0})
vi_vn: Độ dài mật khẩu {0} quá ngắn
zh_tw: 密碼長度 {0} 太短

# Identity_RecoveryCodeRedemptionFailed
source: Recovery code retrieval failed
de_de: Wiederherstellungscode-Abruf fehlgeschlagen
es_es: Error al recuperar el código de recuperación
fr_fr: Échec de la récupération du code de récupération
id_id: Gagal mengambil kode pemulihan
ja_jp: 復元コードの引き換えに失敗しました
ko_kr: 복구 코드 오류
ru_ru: Ошибка при получении кода восстановления
vi_vn: Lấy mã khôi phục thất bại
zh_tw: 恢復代碼找回失敗

# Identity_UnknownError
source: Unknown error
de_de: Unbekannter Fehler
es_es: Error desconocido
fr_fr: Erreur inconnue
id_id: Kesalahan tidak diketahui
ja_jp: 不明なエラー
ko_kr: 알수없는 오류
ru_ru: Неизвестная ошибка
vi_vn: Lỗi không xác định
zh_tw: 未知錯誤

# Identity_UserAlreadyHasPassword
source: User password already exists
de_de: Benutzerpasswort existiert bereits
es_es: La contraseña del usuario ya existe
fr_fr: Le mot de passe de l'utilisateur existe déjà
id_id: Kata sandi pengguna sudah ada
ja_jp: ユーザーパスワードは既に存在しています
ko_kr: 사용자에게 이미 비밀번호가 존재합니다.
ru_ru: Пароль пользователя уже существует
vi_vn: Mật khẩu người dùng đã tồn tại
zh_tw: 用戶密碼已存在

# Identity_UserAlreadyInRole
source: User already in role {0}
de_de: Benutzer bereits in Rolle {0}
es_es: El usuario ya está en el rol {0}
fr_fr: L'utilisateur est déjà dans le rôle {0}
id_id: Pengguna sudah berada dalam role {0}
ja_jp: ユーザーは既にロール {0} に割り当てられています。
ko_kr: 사용자는 이미 {0} 입니다.
ru_ru: Пользователь уже имеет роль {0}
vi_vn: Người dùng đã thuộc vai trò {0}
zh_tw: 用戶已在角色 {0} 中

# Identity_UserLockoutNotEnabled
source: User Lock is not enabled
de_de: Benutzersperre ist nicht aktiviert
es_es: El bloqueo de usuario no está habilitado
fr_fr: Le verrouillage de l'utilisateur n'est pas activé
id_id: Kunci pengguna tidak diaktifkan
ja_jp: ユーザー ロックが有効になっていません
ko_kr: 사용자 잠금이 활성화되지 않았습니다.
ru_ru: Блокировка пользователей не включена
vi_vn: Khóa người dùng chưa được bật
zh_tw: 用戶鎖定未啟用

# Identity_UserNotInRole
source: User does not exist in role {0}
de_de: Benutzer existiert nicht in Rolle {0}
es_es: El usuario no existe en el rol {0}
fr_fr: L'utilisateur n'existe pas dans le rôle {0}
id_id: Pengguna tidak ada dalam role {0}
ja_jp: ユーザーはロール {0} に割り当てられていません。
ko_kr: 사용자가 {0} 이 아닙니다.
ru_ru: Пользователь не существует в роли {0}
vi_vn: Người dùng không thuộc vai trò {0}
zh_tw: 用戶在角色 {0} 中不存在

# Init_AdminCreationFailed
source: Failed to create the administrator account, error message: {0}
de_de: Erstellung des Administratorkontos fehlgeschlagen, Fehlermeldung: {0}
es_es: No se pudo crear la cuenta de administrador, mensaje de error: {0}
fr_fr: Échec de la création du compte administrateur, message d'erreur : {0}
id_id: Gagal membuat akun administrator, pesan error: {0}
ja_jp: 管理者のアカウント作成に失敗しました。エラー：{0}
ko_kr: 관리자 계정을 만들지 못했습니다. 오류 메시지: {0}
ru_ru: Не удалось создать учётную запись администратора, ошибка: {0}
vi_vn: Không tạo được tài khoản quản trị viên, lỗi: {0}
zh_tw: 管理員帳戶創建失敗，錯誤信息：{0}

# Init_CaptureNotAvailable
source: Unable to capture traffic when not using platform proxy mode!
de_de: Verkehrserfassung nicht möglich, wenn die Plattform-Proxy-Modus nicht verwendet wird!
es_es: ¡No se puede capturar el tráfico cuando no se usa el modo proxy de la plataforma!
fr_fr: Impossible de capturer le trafic sans utiliser le mode proxy de la plateforme !
id_id: Tidak bisa menangkap traffic jika tidak menggunakan mode proxy platform!
ja_jp: プラットフォームプロキシを利用していない時にトラフィックのキャプチャを行うことができません！
ko_kr: 플랫폼 프록시 모드를 사용하지 않아 트래픽을 캡처할 수 없습니다!
ru_ru: Невозможно перехватить трафик, не используя прокси сервис платформы!
vi_vn: Không thể bắt lưu lượng truy cập khi không sử dụng chế độ proxy của nền tảng!
zh_tw: 在不使用平臺代理模式時無法進行流量捕獲！

# Init_InvalidCacheConfig
source: Invalid cache configuration, please check the "RedisCache" field configuration. If you're not using Redis, please leave the configuration item empty.
de_de: Ungültige Cache-Konfiguration, bitte prüfen Sie die Konfiguration des "RedisCache"-Feldes. Wenn Sie Redis nicht verwenden, lassen Sie das Konfigurationselement bitte leer.
es_es: Configuración de caché inválida, por favor, verifique la configuración del campo "RedisCache". Si no está usando Redis, deje el ítem de configuración vacío.
fr_fr: Configuration de cache invalide, veuillez vérifier la configuration du champ "RedisCache". Si vous n'utilisez pas Redis, veuillez laisser l'élément de configuration vide.
id_id: Konfigurasi cache tidak valid, silakan periksa konfigurasi field 'RedisCache'. Jika kamu tidak menggunakan Redis, biarkan item konfigurasi kosong.
ja_jp: キャッシュ構成は無効です。RedisCache フィールドを確認してください。Redis を使用しない場合は、構成を空に設定してください。
ko_kr: 캐시 구성이 잘못되었습니다. "RedisCache" 필드 구성을 확인하십시오. Redis를 사용하지 않는 경우 구성 항목을 비워두세요.
ru_ru: Неверная конфигурация кэша, пожалуйста проверьте поле "RedisCache". Если Redis не используется, пожалуйста, оставьте поле пустым.
vi_vn: Cấu hình cache không hợp lệ, vui lòng kiểm tra trường "RedisCache". Nếu không sử dụng Redis, hãy để trống cấu hình.
zh_tw: 緩存配置無效，請檢查 RedisCache 欄位配置。如不使用 Redis 請將配置項置空。

# Init_PostContent
source: The project is based on the AGPL-3.0 license, open sourced at [GZTimeWalker/GZCTF](https://github.com/GZTimeWalker/GZCTF).
de_de: Das Projekt basiert auf der AGPL-3.0-Lizenz, Open Source unter [GZTimeWalker/GZCTF](https://github.com/GZTimeWalker/GZCTF).
es_es: El proyecto está basado en la licencia AGPL-3.0, código abierto en [GZTimeWalker/GZCTF](https://github.com/GZTimeWalker/GZCTF).
fr_fr: Le projet est basé sur la licence AGPL-3.0, open source sur [GZTimeWalker/GZCTF](https://github.com/GZTimeWalker/GZCTF).
id_id: Proyek ini berbasis pada lisensi AGPL-3.0 dan bersifat open source di [GZTimeWalker/GZCTF](https://github.com/GZTimeWalker/GZCTF).
ja_jp: プロジェクトは AGPL-3.0 ライセンスで [GZTimeWalker/GZCTF](https://github.com/GZTimeWalker/GZCTF) にオープンソースされています。
ru_ru: Проект основан на лицензии AGPL-3.0, исходный код: [GZTimeWalker/GZCTF](https://github.com/GZTimeWalker/GZCTF).
vi_vn: Dự án này dựa trên giấy phép AGPL-3.0, mã nguồn mở tại [GZTimeWalker/GZCTF](https://github.com/GZTimeWalker/GZCTF).
zh_tw: 項目基於 AGPL-3.0 許可證，開源於 [GZTimeWalker/GZCTF](https://github.com/GZTimeWalker/GZCTF)。

# Init_PostSummary
source: An open-source CTF platform
de_de: Eine Open-Source-CTF-Plattform
es_es: Una plataforma CTF de código abierto
fr_fr: Une plateforme CTF open source
id_id: Sebuah platform CTF open source
ja_jp: オープンソース CTF プラットフォーム
ru_ru: CTF-платформа с открытым исходным кодом
vi_vn: Nền tảng CTF mã nguồn mở
zh_tw: 一個開源的CTF比賽平臺

# Init_PostTitle
source: Welcome to GZ::CTF!
de_de: Willkommen bei GZ::CTF!
es_es: ¡Bienvenido a GZ::CTF!
fr_fr: Bienvenue sur GZ::CTF !
id_id: Selamat datang di GZ::CTF!
ja_jp: GZ::CTF へようこそ！
ru_ru: Добро пожаловать в GZ::CTF!
vi_vn: Chào mừng bạn đến với GZ::CTF!
zh_tw: 歡迎使用 GZ::CTF

# InstanceRepository_ContainerAutoDestroy
source: {0} Auto-destroy container instance of problem {1} [{2}]
de_de: {0} hat den Container [{2}] der Herausforderung {1} automatisch zerstört
es_es: {0} destruyó automáticamente el contenedor [{2}] del desafío {1}
fr_fr: {0} a détruit automatiquement le conteneur [{2}] du défi {1}
id_id: {0} secara otomatis menghapus container [{2}] dari challenge {1}
ja_jp: {0} はチャレンジ {1} のコンテナインスタンス [{2}] を自動的に破棄しました
ko_kr: 문제 {1}의 {0} 컨테이너 [{2}]가 자동으로 삭제되었습니다
ru_ru: Контейнер [{2}] команды {0} из задания {1} автоматически уничтожен
vi_vn: {0} đã tự động xóa container [{2}] của thử thách {1}
zh_tw: {0} 自動銷毀題目 {1} 的容器實例 [{2}]

# InstanceRepository_ContainerCreated
source: {0} launches container instance of problem {1} [{2}]
de_de: {0} startet Containerinstanz der Herausforderung {1} [{2}]
es_es: {0} inicia la instancia del contenedor del desafío {1} [{2}]
fr_fr: {0} lance une instance de conteneur du défi {1} [{2}]
id_id: {0} meluncurkan instance kontainer dari challenge {1} [{2}]
ja_jp: {0} はチャレンジ {1} のコンテナインスタンス [{2}] を起動しました
ko_kr: {0} 팀이 문제 {1} 의 컨테이너 인스턴스를 생성했습니다. [{2}]
ru_ru: Команда {0} создала контейнер [{2}] для задания {1}
vi_vn: {0} khởi chạy container của thử thách {1} [{2}]
zh_tw: {0} 啟動題目 {1} 的容器實例 [{2}]

# InstanceRepository_ContainerCreationFailed
source: Could not start container instance for problem {0}
de_de: Konnte Containerinstanz für Herausforderung {0} nicht starten
es_es: No se pudo iniciar la instancia del contenedor para el desafío {0}
fr_fr: Impossible de démarrer une instance de conteneur pour le défi {0}
id_id: Tidak bisa memulai instance container untuk challenge {0}
ja_jp: チャレンジ {0} のコンテナインスタンスを起動できませんでした
ko_kr: 문제 {0} 의 컨테이너 인스턴스를 시작할 수 없습니다.
ru_ru: Не удалось запустить экземпляр контейнера для задания {0}
vi_vn: Không thể khởi chạy container cho thử thách {0}
zh_tw: 無法為題目 {0} 啟動容器實例

# ContainerRepository_ContainerDestroyFailed
source: Destroy container [{0}] ({1}): {2}
de_de: Zerstöre Container [{0}] ({1}): {2}
es_es: Destruir contenedor [{0}] ({1}): {2}
fr_fr: Détruire le conteneur [{0}] ({1}): {2}
id_id: Menghapus container [{0}] ({1}): {2}
ja_jp: コンテナ [{0}] ({1}) を破棄できませんでした: {2}
ko_kr: 컨테이너 삭제 [{0}] ({1}): {2}
ru_ru: Уничтожение контейнера [{0}] ({1}): {2}
vi_vn: Xóa container [{0}] ({1}): {2}
zh_tw: 銷毀容器 [{0}] ({1}): {2}

# InstanceRepository_DynamicFlagsNotEnough
source: Insufficient number of dynamic attachments requested for problem {0}#{1}
de_de: Ungenügende Anzahl von dynamischen Anhängen für die Herausforderung {0}#{1} zugewiesen
es_es: Número insuficiente de adjuntos dinámicos asignados para el desafío {0}#{1}
fr_fr: Nombre insuffisant de pièces jointes dynamiques allouées pour le défi {0}#{1}
id_id: Jumlah lampiran dinamis yang dialokasikan untuk challenge {0}#{1} tidak mencukupi
ja_jp: チャレンジ {0}#{1} がリクエストした動的添付数量は不足しています
ko_kr: 문제 {0}#{1} 에 할당된 동적 인스턴스 수가 부족합니다.
ru_ru: Недостаточное количество динамических вложений, выделенных для задания {0}#{1}
vi_vn: Không đủ số lượng tệp đính kèm động được cấp phát cho thử thách {0}#{1}
zh_tw: 題目 {0}#{1} 請求分配的動態附件數量不足

# InstanceRepository_GetInstanceFailed
source: {0} fail to create instance for challenge {1}#{2} (may cause by concurrent conflicts), rolling back...
de_de: {0} konnte keine Instanz für die Herausforderung {1}#{2} erstellen (möglicherweise durch gleichzeitige Konflikte verursacht), wird zurückgesetzt...
es_es: {0} no pudo crear la instancia para el desafío {1}#{2} (puede ser causado por conflictos concurrentes), haciendo rollback...
fr_fr: {0} n'a pas pu créer d'instance pour le défi {1}#{2} (peut être causé par des conflits concurrents), retour en arrière...
id_id: {0} gagal membuat instance untuk tantangan {1}#{2} (mungkin disebabkan oleh konflik concurrent), Rollback dikit...
ja_jp: {0} のチャレンジ {1}#{2} のインスタンスを取得中に問題が発生しました（同時実行エラーが原因である可能性があります）。ロールバックします。
ko_kr: {0} 팀이 문제 {1}#{2} 인스턴스 생성에 실패했습니다. 되돌리는 중..
ru_ru: Команда {0} неудачно попыталась создать контейнер для задания {1}#{2} (возможно, ошибки многозадачности), производится откат...
vi_vn: {0} không thể tạo instance cho challenge {1}#{2} (có thể do concurrent conflicts), đang hoàn tác...
zh_tw: 為 {0} 獲取題目 {1}#{2} 的實例時遇到問題（可能由於並發錯誤），回滾中

# InstanceRepository_InvalidPort
source: Invalid port when creating a container
de_de: Ungültiger Port beim Erstellen eines Containers
es_es: Puerto inválido al crear un contenedor
fr_fr: Port invalide lors de la création d'un conteneur
id_id: Port tidak valid saat membuat container
ja_jp: コンテナの作成中に無効なポートを遭遇しました
ko_kr: 컨테이너 생성 중 잘못된 port 발견
ru_ru: Неверный порт при создании контейнера
vi_vn: Cổng không hợp lệ khi tạo container
zh_tw: 創建容器時遇到無效的埠

# InstanceRepository_NoInstance
source: Team participants are empty, this may be unexpectedly [{0}, {1}]
de_de: Die Teamteilnehmer sind leer, dies könnte unerwartet sein [{0}, {1}]
es_es: Los participantes del equipo están vacíos, esto puede ser inesperado [{0}, {1}]
fr_fr: Les participants de l'équipe sont vides, cela peut être inattendu [{0}, {1}]
id_id: Peserta tim kosong, ini mungkin tidak terduga [{0}, {1}]
ja_jp: チームを対応する参加者は空です。これは予期されていない状況かもしれません [{0}, {1}]
ko_kr: 팀 참가자가 비어 있습니다. [{0}, {1}]
ru_ru: Неожиданная ошибка: команда не имеет участников при получении экземпляра задания [{0}, {1}]
vi_vn: Danh sách thành viên trong đội trống, điều này có thể không như mong đợi [{0}, {1}]
zh_tw: 隊伍對應參與對象為空，這可能是非預期的情況 [{0}, {1}]

# MailSender_ChangeEmailButton
source: Verify Email
de_de: E-Mail verifizieren
es_es: Verificar correo electrónico
fr_fr: Vérifier l'email
id_id: Verifikasi Email
ja_jp: メールを認証する
ko_kr: Email 인증
ru_ru: Подтвердить почту
vi_vn: Xác minh Email
zh_tw: 確認驗證郵箱

# MailSender_ChangeEmailContent
source: You are performing an account email change operation, please click the button below to verify your new email.
de_de: Sie führen eine Aktion zur Änderung der Konto-E-Mail durch. Bitte klicken Sie auf die Schaltfläche unten, um Ihre neue E-Mail zu verifizieren.
es_es: Está realizando una operación de cambio de correo electrónico de la cuenta, por favor haga clic en el botón de abajo para verificar su nuevo correo electrónico.
fr_fr: Vous effectuez une opération de changement d'email de compte, veuillez cliquer sur le bouton ci-dessous pour vérifier votre nouvel email.
id_id: Kamu sedang melakukan proses perubahan email akun. Silakan klik tombol di bawah ini untuk memverifikasi email barumu.
ja_jp: アカウントのメールアドレスの変更を行っています。下のボタンをクリックして新しいメールアドレスを認証してください。
ko_kr: 버튼을 눌러 새로운 이메일을 인증하세요.
ru_ru: Для Вашего аккаунта запрошено изменение привязанной почты. Чтобы подтвердить изменение и верифицировать новую почту, нажмите кнопку ниже.
vi_vn: Bạn đang thay đổi email tài khoản, nhấp vào nút dưới đây để xác minh email mới.
zh_tw: 你正在進行帳戶郵箱更換操作，請點擊下方按鈕驗證你的新郵箱。

# MailSender_ChangeEmailTitle
source: Change Email
de_de: E-Mail ändern
es_es: Cambiar correo electrónico
fr_fr: Changer l'email
id_id: Ubah email
ja_jp: メールの変更
ko_kr: 이메일 변경
ru_ru: Изменить адрес эл. почты
vi_vn: Cập nhật Email
zh_tw: 更換郵箱

# MailSender_InvalidRequest
source: Invalid mail request
de_de: Ungültige Mail-Anfrage
es_es: Solicitud de correo inválida
fr_fr: Requête de mail invalide
id_id: Permintaan email tidak valid
ja_jp: メール送信リクエストは無効です
ko_kr: 잘못된 이메일 요청
ru_ru: Недопустимый почтовый запрос
vi_vn: Mail request không hợp lệ
zh_tw: 無效的郵件發送調用

# MailSender_MailSendFailed
source: Failed to delivery mail
de_de: Zustellung der E-Mail fehlgeschlagen
es_es: Fallo al enviar el correo
fr_fr: Échec de l'envoi du mail
id_id: Gagal mengirim email
ja_jp: メールの送信に失敗しました
ko_kr: 이메일 전송 실패
ru_ru: Не удалось доставить письмо
vi_vn: Gửi mail không thành công
zh_tw: 郵件發送失敗

# MailSender_ResetPasswordButton
source: Confirm reset password
de_de: Passwortzurücksetzung bestätigen
es_es: Confirmar restablecimiento de contraseña
fr_fr: Confirmer la réinitialisation du mot de passe
id_id: Konfirmasi reset password
ja_jp: パスワードをリセットする
ko_kr: 비밀번호 재설정
ru_ru: Подтвердить сброс пароля
vi_vn: Xác nhận đặt lại mật khẩu
zh_tw: 確認重置密碼

# MailSender_ResetPasswordContent
source: You are performing an account password reset operation. Please click the button below to reset your password.
de_de: Sie führen eine Konto-Passwortzurücksetzung durch. Bitte klicken Sie auf die Schaltfläche unten, um Ihr Passwort zurückzusetzen.
es_es: Está realizando una operación de restablecimiento de contraseña de cuenta. Por favor, haga clic en el botón de abajo para restablecer su contraseña.
fr_fr: Vous effectuez une opération de réinitialisation du mot de passe du compte. Veuillez cliquer sur le bouton ci-dessous pour réinitialiser votre mot de passe.
id_id: Kamu sedang melakukan proses reset kata sandi akun. Silakan klik tombol di bawah ini untuk mereset kata sandimu.
ja_jp: アカウントのパスワードのリセットを行っています。パスワードをリセットするには、下のボタンをクリックしてパスワードをリセットしてください。
ko_kr: 버튼을 눌러 비밀번호를 재설정하세요.
ru_ru: Для Вашего аккаунта запрошен сброс пароля. Чтобы подтвердить сброс, нажмите кнопку ниже.
vi_vn: Bạn đang thực hiện đặt lại mật khẩu. Vui lòng nhấp vào nút bên dưới để đặt lại mật khẩu của bạn.
zh_tw: 你正在進行帳戶密碼重置操作，請點擊下方按鈕重置你的密碼。

# MailSender_ResetPasswordTitle
source: Reset password
de_de: Passwort zurücksetzen
es_es: Restablecer contraseña
fr_fr: Réinitialiser le mot de passe
id_id: Atur ulang kata sandi
ja_jp: パスワードのリセット
ko_kr: 비밀번호 초기화
ru_ru: Сброс пароля
vi_vn: Đặt lại mật khẩu
zh_tw: 重置密碼

# MailSender_SendMail
source: Send mail: {0}
de_de: E-Mail senden: {0}
es_es: Enviar correo: {0}
fr_fr: Envoyer le mail : {0}
id_id: Kirim email: {0}
ja_jp: {0} にメールを送信します
ko_kr: 이메일 전송: {0}
ru_ru: Отправка письма: {0}
vi_vn: Gửi mail: {0}
zh_tw: 發送郵件：{0}
