Repository: GZTimeWalker/GZCTF
Catalog: src/GZCTF/Resources/Program.*.resx
Languages: de_de, es_es, fr_fr, id_id, ja_jp, ko_kr, ru_ru, vi_vn, zh_cn, zh_tw

# Config_GlobalConfigAdded
source: Global configuration added: {0} => {1}
de_de: Globale Konfiguration hinzugefügt: {0} => {1}
es_es: Configuración global añadida: {0} => {1}
fr_fr: Configuration globale ajoutée : {0} => {1}
id_id: Konfigurasi global ditambahkan: {0} => {1}
ja_jp: グローバル構成が追加されました：{0} => {1}
ko_kr: 전역 설정 추가됨: {0} => {1}
ru_ru: Добавлен параметр настроек платформы: {0} => {1}
vi_vn: Global Config đã được thêm: {0} => {1}
zh_cn: 添加全局设置：{0} => {1}
zh_tw: 添加全局設置：{0} => {1}

# Config_GlobalConfigUpdated
source: Global configuration updated: {0} => {1}
de_de: Globale Konfiguration aktualisiert: {0} => {1}
es_es: Configuración global actualizada: {0} => {1}
fr_fr: Configuration globale mise à jour : {0} => {1}
id_id: Konfigurasi global diperbaru: {0} => {1}
ja_jp: グローバル構成が更新されました：{0} => {1}
ko_kr: 전역 설정 업데이트됨: {0} => {1}
ru_ru: Изменен параметр настроек платформы: {0} => {1}
vi_vn: Global Config đã được cập nhật: {0} => {1}
zh_cn: 更新全局设置：{0} => {1}
zh_tw: 更新全局設置：{0} => {1}

# Config_InitializingDatabase
source: Initializing database...
de_de: Initialisiere Datenbank...
es_es: Inicializando la base de datos...
fr_fr: Initialisation de la base de données...
id_id: Sedang melakukan inisialisasi database...
ja_jp: データベースを初期化しています...
ko_kr: 데이터베이스 초기화중...
ru_ru: Инициализация базы данных...
vi_vn: Đang khởi tạo cơ sở dữ liệu...
zh_cn: 初始化数据库……
zh_tw: 初始化資料庫……

# Config_ReloadFailed
source: Failed to reload global configuration
de_de: Fehler beim Neuladen der globalen Konfiguration
es_es: Error al recargar la configuración global
fr_fr: Échec du rechargement de la configuration globale
id_id: Gagal memuat ulang keseluruhan konfigurasi
ja_jp: グローバル構成がリロードできませんでした
ko_kr: 전역 설정을 불러오는데 실패했습니다.
ru_ru: Не удалось перезагрузить глобальную конфигурацию
vi_vn: Không thể tải lại Global Config
zh_cn: 全局配置重载失败
zh_tw: 全局配置重載失敗

# Config_TypeNotSupported
source: Unsupported configuration type
de_de: Nicht unterstützter Konfigurationstyp
es_es: Tipo de configuración no compatible
fr_fr: Type de configuration non pris en charge
id_id: Tipe konfigurasi tidak didukung
ja_jp: 構成のタイプがサポートされていません
ko_kr: 지원하지 않는 설정 타입입니다.
ru_ru: Данный тип аргумента не поддерживается
vi_vn: Loại config không được hỗ trợ
zh_cn: 不支持的配置项类型
zh_tw: 不支持的配置項類型

# ContainerManager_ContainerCreationFailed
source: Failed to create container {0}
de_de: Fehler beim Erstellen des Containers {0}
es_es: Error al crear el contenedor {0}
fr_fr: Échec de création du conteneur {0}
id_id: Gagal membuat container {0}
ja_jp: コンテナ {0} を作成できませんでした
ko_kr: 컨테이너 생성 실패 {0}
ru_ru: Не удалось создать контейнер {0}
vi_vn: Không tạo được container {0}
zh_tw: 容器 {0} 創建失敗

# ContainerManager_ContainerCreationFailedResponse
source: Failed to create container {0}, response: {1}
de_de: Fehler beim Erstellen des Containers {0}, Antwort: {1}
es_es: Error al crear el contenedor {0}, respuesta: {1}
fr_fr: Échec de création du conteneur {0}, réponse : {1}
id_id: Gagal membuat container {0}, response: {1}
ja_jp: コンテナ {0} を作成できませんでした、レスポンス：{1}
ko_kr: 컨테이너 생성 실패 {0}, 응답: {1}
ru_ru: Не удалось создать контейнер {0}, ответ: {1}
vi_vn: Không tạo được container {0}, phản hồi: {1}
zh_tw: 容器 {0} 創建失敗, 響應：{1}

# ContainerManager_ContainerCreationFailedStatus
source: Failed to create container {0}, status: {1}
de_de: Fehler beim Erstellen des Containers {0}, Status: {1}
es_es: Error al crear el contenedor {0}, estado: {1}
fr_fr: Échec de création du conteneur {0}, statut : {1}
id_id: Gagal membuat container {0}, status: {1}
ja_jp: コンテナ {0} を作成できませんでした、ステータス：{1}
ko_kr: 컨테이너 생성 실패 {0}, status: {1}
ru_ru: Не удалось создать контейнер {0}, статус: {1}
vi_vn: Không tạo được container {0}, trạng thái: {1}
zh_tw: 容器 {0} 創建失敗, 狀態：{1}

# ContainerManager_ContainerDeletionFailed
source: Failed to delete container {0}
de_de: Fehler beim Löschen des Containers {0}
es_es: Error al eliminar el contenedor {0}
fr_fr: Échec de suppression du conteneur {0}
id_id: Gagal menghapus container {0}
ja_jp: コンテナ {0} を削除できませんでした
ko_kr: 컨테이너 삭제 실패 {0}
ru_ru: Не удалось уничтожить контейнер {0}
vi_vn: Không xóa được container {0}
zh_tw: 容器 {0} 刪除失敗

# ContainerManager_ContainerDeletionFailedResponse
source: Failed to delete container {0}, response: {1}
de_de: Fehler beim Löschen des Containers {0}, Antwort: {1}
es_es: Error al eliminar el contenedor {0}, respuesta: {1}
fr_fr: Échec de suppression du conteneur {0}, réponse : {1}
id_id: Gagal menghapus container {0}, response: {1}
ja_jp: コンテナ {0} を削除できませんでした、レスポンス：{1}
ko_kr: 컨테이너 삭제 실패 {0}, 응답: {1}
ru_ru: Не удалось уничтожить контейнер {0}, ответ: {1}
vi_vn: Không xóa được container {0}, phản hồi: {1}
zh_tw: 容器 {0} 刪除失敗, 響應：{1}

# ContainerManager_ContainerDeletionFailedStatus
source: Failed to delete container {0}, status: {1}
de_de: Löschen des Containers {0} fehlgeschlagen, Status: {1}
es_es: No se pudo eliminar el contenedor {0}, estado: {1}
fr_fr: Échec de suppression du conteneur {0}, statut : {1}
id_id: Gagal menghapus container {0}, status: {1}
ja_jp: コンテナ {0} を削除できませんでした、ステータス：{1}
ko_kr: 컨테이너 삭제 실패 {0}, status: {1}
ru_ru: Не удалось уничтожить контейнер {0}, статус: {1}
vi_vn: Không xóa được container {0}, trạng thái: {1}
zh_tw: 容器 {0} 刪除失敗, 狀態：{1}

# ContainerManager_ContainerDestroyed
source: Container {0} has been destroyed
de_de: Container {0} wurde zerstört
es_es: El contenedor {0} ha sido destruido
fr_fr: Le conteneur {0} a été détruit
id_id: Container {0} berhasil dihapus
ja_jp: コンテナ {0} は破壊されました
ko_kr: 컨테이너 {0} 가 삭제되었습니다.
ru_ru: Контейнер {0} уничтожен
vi_vn: Đã xoá container {0}
zh_tw: 容器 {0} 已被銷毀

# ContainerManager_ContainerExisted
source: Container {0} already exists, try removing it and recreating it
de_de: Container {0} existiert bereits, versuchen Sie, ihn zu entfernen und erneut zu erstellen
es_es: El contenedor {0} ya existe, intenta eliminarlo y recrearlo
fr_fr: Le conteneur {0} existe déjà, essayez de le supprimer et de le recréer
id_id: Container {0} sudah ada, coba hapus dan buat ulang lagi
ja_jp: コンテナの {0} は既に存在しているため、削除後に再作成します
ko_kr: 컨테이너 {0} 가 이미 존재합니다. 삭제 후 다시 생성하십시오.
ru_ru: Контейнер {0} уже существует, попробуйте сначала уничтожить его
vi_vn: Container {0} đã tồn tại, hãy thử xóa và tạo lại
zh_tw: 容器 {0} 已存在，嘗試移除後重新創建

# ContainerManager_ContainerInstanceCreationFailed
source: Container instance {0} failed to create
de_de: Erstellung der Containerinstanz {0} fehlgeschlagen
es_es: No se pudo crear la instancia del contenedor {0}
fr_fr: L'instance de conteneur {0} n'a pas pu être créée
id_id: Gagal membuat instance container {0}
ja_jp: コンテナのインスタンス {0} を作成できませんでした
ko_kr: 컨테이너 인스턴스 {0} 생성 실패
ru_ru: Не удалось создать экземпляр контейнера {0}
vi_vn: Không tạo được container instance {0}
zh_tw: 容器實例 {0} 創建失敗

# ContainerManager_ContainerInstanceCreationFailedWithError
source: Error creating {0} instance：{1}
de_de: Fehler beim Erstellen von {0} Instanz：{1}
es_es: Error al crear la instancia {0}：{1}
fr_fr: Erreur lors de la création de l'instance {0}：{1}
id_id: Kesalahan membuat instance {0}: {1}
ja_jp: コンテナ {0} を作成できませんでした：{1}
ko_kr: {0} 인스턴스 생성 실패 : {1}
ru_ru: Ошибка создания экземпляра {0}：{1}
vi_vn: Lỗi khi tạo instance {0}: {1}
zh_tw: 創建 {0} 實例遇到錯誤：{1}

# ContainerManager_ContainerInstanceStartFailed
source: Failed to start container instance {0} ({1})
de_de: Starten der Containerinstanz {0} ({1}) fehlgeschlagen
es_es: No se pudo iniciar la instancia del contenedor {0} ({1})
fr_fr: Échec du démarrage de l'instance de conteneur {0} ({1})
id_id: Gagal memulai container instanse {0} ({1})
ja_jp: コンテナ {0} ({1}) を起動できませんでした
ko_kr: 컨테이너 인스턴스 {0} 실행 실패 ({1})
ru_ru: Не удалось запустить экземпляр контейнера {0} ({1})
vi_vn: Không khởi động được container instance {0} ({1})
zh_tw: 啟動容器實例 {0} ({1}) 失敗

# ContainerManager_ContainerPortNotExposed
source: Failed to get port exposure information after container {0} was created
de_de: Fehler beim Abrufen der Port-Expositionsinformationen nach Erstellung des Containers {0}
es_es: No se pudo obtener la información de exposición del puerto después de que se creó el contenedor {0}
fr_fr: Échec de l'obtention des informations d'exposition du port après la création du conteneur {0}
id_id: Gagal mendapatkan informasi eksposur port setelah kontainer {0} dibuat
ja_jp: コンテナ{0} のポート情報を取得できませんでしたため作成に失敗しました
ko_kr: {0} 컨테이너 생성 후 외부 port 연결에 실패했습니다.
ru_ru: Не удалось получить информацию об открытии портов контейнера {0} после его создания
vi_vn: Không lấy được thông tin port sau khi tạo container {0}
zh_tw: 容器 {0} 創建後未獲取到埠暴露信息，創建失敗

# ContainerManager_DockerMode
source: Container mode：Docker Instance Container Controls
de_de: Containermodus: Docker-Instanz-Containersteuerung
es_es: Modo de contenedor: Controles de contenedor de instancia Docker
fr_fr: Mode conteneur：Contrôles de conteneur d'instance Docker
id_id: Mode container ： kontrol container instance docker instance
ja_jp: コンテナ管理モード：Docker 単一インスタンスコンテナー制御
ko_kr: 컨테이너 모드: Docker Instance 컨테이너 제어
ru_ru: Режим контейнеризации：Docker Instance Container Controls
zh_tw: 容器管理模式：Docker 單實例容器控制

# ContainerManager_K8sMode
source: Container Mode：K8s Cluster Pod Container Control
de_de: Containermodus: K8s-Cluster-Pod-Containersteuerung
es_es: Modo de contenedor: Control de contenedor de pod de clúster K8s
fr_fr: Mode Conteneur：Contrôle de conteneur de pod de cluster K8s
id_id: Mode Kontainer ： kontrol container Pod cluster K8s
ja_jp: コンテナ管理モード：K8s Pod コンテナー制御
ko_kr: 컨테이너 모드 : K8s Cluster Pod 컨테이너 제어
ru_ru: Режим контейнеризации：K8s Cluster Pod Container Control
zh_tw: 容器管理模式：K8s 集群 Pod 容器控制

# ContainerManager_PortParsingFailed
source: Cannot convert port number：{0}, this is an unexpected action
de_de: Kann Portnummer nicht konvertieren: {0}, dies ist eine unerwartete Aktion
es_es: No se puede convertir el número de puerto: {0}, esta es una acción inesperada
fr_fr: Impossible de convertir le numéro de port：{0}, c'est une action imprévue
id_id: Tidak dapat mengonversi nomor port：{0}, ini adalah tindakan yang tidak terduga
ja_jp: ポート番号を変換できませんでした：{0}
ko_kr: port 는 숫자여야합니다 : {0}
ru_ru: Не удалось преобразовать номер порта：{0} - это неожиданное действие
vi_vn: Không thể chuyển đổi port: {0}, lỗi không mong muốn
zh_tw: 無法轉換埠號：{0}，這是非預期的行為

# ContainerManager_PullContainerImage
source: Pull container image {0}
de_de: Container-Image {0} ziehen
es_es: Extraer imagen de contenedor {0}
fr_fr: Extraire l'image du conteneur {0}
id_id: Menarik container image {0}
ja_jp: コンテナイメージ {0} を取得しています
ko_kr: {0} 컨테이너 이미지 가져오기
ru_ru: Получение образа контейнера {0}
vi_vn: Đang tải container image {0}.
zh_tw: 拉取容器鏡像 {0}

# ContainerManager_ServiceCreationFailed
source: Service {0} failed to create
de_de: Dienst {0} konnte nicht erstellt werden
es_es: El servicio {0} no se pudo crear
fr_fr: Le service {0} n'a pas pu être créé
id_id: Layanan {0} gagal dibuat
ja_jp: サービス {0} を作成できませんでした
ko_kr: 서비스 {0} 생성 실패
ru_ru: Не удалось создать службу {0}
vi_vn: Không thể tạo dịch vụ {0}.
zh_tw: 服務 {0} 創建失敗

# ContainerManager_ServiceCreationFailedResponse
source: The service {0} failed to create, response: {1}
de_de: Der Dienst {0} konnte nicht erstellt werden, Antwort: {1}
es_es: El servicio {0} no se pudo crear, respuesta: {1}
fr_fr: Le service {0} n'a pas pu être créé, réponse : {1}
id_id: Layanan {0} gagal dibuat, respons: {1}
ja_jp: サービス {0} を作成できませんでした、レスポンス：{1}
ko_kr: 서비스 {0} 생성 실패, 응답: {1}
ru_ru: Не удалось создать службу {0}, ответ: {1}
vi_vn: Dịch vụ {0} không được tạo thành công, phản hồi: {1}.
zh_tw: 服務 {0} 創建失敗, 響應：{1}

# ContainerManager_ServiceCreationFailedStatus
source: The service {0} failed to create, status: {1}
de_de: Der Dienst {0} konnte nicht erstellt werden, Status: {1}
es_es: El servicio {0} no se pudo crear, estado: {1}
fr_fr: Le service {0} n'a pas pu être créé, statut : {1}
id_id: Layanan {0} gagal dibuat, status: {1}
ja_jp: サービス {0} を作成できませんでした、ステータス：{1}
ko_kr: 서비스 {0} 생성 실패, status: {1}
ru_ru: Не удалось создать службу {0}, статус: {1}
vi_vn: Không thể tạo dịch vụ {0}, trạng thái: {1}.
zh_tw: 服務 {0} 創建失敗, 狀態：{1}

# ContainerManager_SwarmMode
source: Container mode：Docker Swarm Cluster Container Control
de_de: Containermodus: Docker Swarm Cluster Containersteuerung
es_es: Modo de contenedor: Control de contenedor de clúster Docker Swarm
fr_fr: Mode de conteneur : Docker Swarm Cluster Container Control
id_id: Mode container ： docker swarm cluster kontrol container
ja_jp: コンテナ管理モード：Docker Swarm クラスタコンテナー制御
ko_kr: 컨테이너 모드: Docker Swarm Cluster 컨테이너 제어
ru_ru: Режим контейнеризации：Docker Swarm Cluster Container Control
vi_vn: Chế độ container: Điều khiển cụm container Docker Swarm.
zh_tw: 容器管理模式：Docker Swarm 集群容器控制

# ContainerManager_UnresolvedImageName
source: Could not parse image name `{0}'
de_de: Konnte den Bildnamen '{0}' nicht analysieren
es_es: No se pudo analizar el nombre de la imagen '{0}'
fr_fr: Impossible d'analyser le nom de l'image '{0}'
id_id: Tidak dapat mengurai nama gambar '{0}'
ja_jp: コンテナイメージ名 '{0}' を解析できませんでした
ko_kr: '{0}' 이미지를 찾을 수 없습니다.
ru_ru: Не удалось извлечь название изображения '{0}'
vi_vn: Không thể phân giải tên image '{0}'.
zh_tw: 無法解析鏡像名稱 '{0}'

# ContainerProvider_DockerInited
source: Docker Initialization Success ({0})
de_de: Docker-Initialisierung erfolgreich ({0})
es_es: Inicialización de Docker exitosa ({0})
fr_fr: Initialisation de Docker réussie ({0})
id_id: Inisialisasi docker berhasil ({0})
ja_jp: Docker が正常に初期化されました ({0})
ko_kr: Docker 초기화 성공 ({0})
ru_ru: Успешная инициализация Docker ({0})
vi_vn: Docker đã khởi tạo thành công ({0}).
zh_tw: Docker 初始化成功 ({0})

# ContainerProvider_KubernetesConfigLoadFailed
source: Could not load K8s profile, make sure that the profile exists in {0}
de_de: K8s-Profil konnte nicht geladen werden, stellen Sie sicher, dass das Profil in {0} existiert
es_es: No se pudo cargar el perfil de K8s, asegúrese de que el perfil exista en {0}
fr_fr: Impossible de charger le profil K8s, assurez-vous que le profil existe dans {0}
id_id: Tidak dapat memuat profil K8s, pastikan profil tersebut ada di {0}
ja_jp: K8s 構成ファイルをロードできませんでした、設定ファイルが存在していますでしょうか：{0}
ko_kr: K8s 프로필을 로드할 수 없습니다. {0} 에 프로필이 존재하는지 확인하십시오.
ru_ru: Не удалось загрузить профиль K8s, убедитесь, что профиль существует в {0}
vi_vn: Không thể tải cấu hình K8s, vui lòng kiểm tra tệp cấu hình tại {0}.
zh_tw: 無法加載 K8s 配置文件，請確保配置文件存在 {0}

# ContainerProvider_KubernetesInited
source: K8s Initialization Success ({0})
de_de: K8s-Initialisierung erfolgreich ({0})
es_es: Inicialización de K8s exitosa ({0})
fr_fr: Initialisation de K8s réussie ({0})
id_id: Inisialisasi K8s Berhasil ({0})
ja_jp: K8s が正常に初期化されました ({0})
ko_kr: K8s 초기화 성공 ({0})
ru_ru: Успешная инициализация K8 ({0})
vi_vn: Kubernetes đã khởi tạo thành công ({0}).
zh_tw: K8s 初始化成功 ({0})

# ContainerProvider_KubernetesInitFailed
source: K8s initialization failed, please check if the configuration is correct ({0})
de_de: K8s-Initialisierung fehlgeschlagen, bitte überprüfen Sie, ob die Konfiguration korrekt ist ({0})
es_es: La inicialización de K8s falló, verifique que la configuración sea correcta ({0})
fr_fr: Échec de l'initialisation de K8s, veuillez vérifier si la configuration est correcte ({0})
id_id: Inisialisasi K8s gagal, silakan periksa apakah konfigurasi sudah benar ({0})
ja_jp: K8s の初期化に失敗しました、構成が正しいかどうかを確認してください ({0})
ko_kr: K8s 초기화 실패. 설정이 올바른지 확인하십시오. ({0})
ru_ru: Ошибка инициализации K8s, проверьте правильность конфигурации ({0})
vi_vn: Kubernetes không thể khởi tạo, vui lòng kiểm tra cấu hình ({0}).
zh_tw: K8s 初始化失敗，請檢查相關配置是否正確 ({0})

# CronJob_BootstrapRankingCache
source: Game #{0} is about to start, adding scoreboard cache to the cache queue
de_de: Spiel #{0} steht kurz vor dem Start, fügt die Punktetafel-Cache zur Cache-Warteschlange hinzu
es_es: El juego n.º {0} está a punto de comenzar, agregando la caché del marcador a la cola de caché
fr_fr: Le jeu n°{0} est sur le point de commencer, ajout de la cache du tableau de scores à la file d'attente de cache
id_id: Permainan #{0} akan segera dimulai, menambahkan cache papan skor ke antrean cache
ja_jp: ゲーム #{0} が間もなく開始されます、ランキング キャッシュがキャッシュ キューに追加されました
ko_kr: #{0} 시작됨. 캐시 큐에 스코어보드 캐시를 추가합니다.
ru_ru: Игра #{0} скоро начнётся, добавление кэша рейтинговой таблицы в очередь кэша
vi_vn: Trò chơi #{0} sắp bắt đầu, thêm cache bảng xếp hạng vào hàng chờ.
zh_cn: 比赛 #{0} 即将开始，积分榜缓存已加入缓存队列
zh_tw: 比賽 #{0} 即將開始，積分榜緩存已加入緩存隊列

# CronJob_RemoveExpiredContainer
source: Expired container [{0}] has been removed
de_de: Abgelaufener Container [{0}] wurde entfernt
es_es: El contenedor caducado [{0}] ha sido eliminado
fr_fr: Le conteneur expiré [{0}] a été supprimé
id_id: Container yang sudah expired [{0}] telah dihapus
ja_jp: 期限切れのコンテナ [{0}] が削除されました
ko_kr: 유효기간이 지난 컨테이너 [{0}] 이 삭제되었습니다.
ru_ru: Истекший контейнер [{0}] уничтожен
vi_vn: Đã xoá Container [{0}] hết hạn
zh_cn: 移除到期容器 [{0}]
zh_tw: 移除到期容器 [{0}]

# CronJob_Started
source: Cron job has been started
de_de: Cron-Job wurde gestartet
es_es: La tarea programada ha sido iniciada
fr_fr: La tâche cron a été démarrée
id_id: Cron job berhasil dijalankan
ja_jp: スケジュールされたタスクが起動されました
ko_kr: Cron 작업이 시작되었습니다.
ru_ru: Cron-задание запущено
vi_vn: Cron job đã được khởi chạy.
zh_cn: 定时任务已启动
zh_tw: 定時任務已啟動

# CronJob_Stopped
source: Cron job has been stopped
de_de: Cron-Job wurde gestoppt
es_es: El trabajo cron se ha detenido
fr_fr: La tâche cron a été arrêtée
id_id: Cron job dihentikan
ja_jp: スケジュールされたタスクが停止されました
ko_kr: Cron 작업이 중단되었습니다.
ru_ru: Cron-задание остановлено
vi_vn: Cron job đã bị dừng.
zh_cn: 定时任务已停止
zh_tw: 定時任務已停止

# Database_ConnectionFailed
source: Failed to connect to the database ({0}), please check the database connection string
de_de: Fehler beim Verbinden mit der Datenbank ({0}), bitte prüfen Sie die Datenbank-Verbindungszeichenfolge
es_es: No se pudo conectar a la base de datos ({0}), por favor verifique la cadena de conexión de la base de datos
fr_fr: Échec de la connexion à la base de données ({0}), veuillez vérifier la chaîne de connexion de la base de données
id_id: Gagal terhubung ke database ({0}), silakan periksa string koneksi database
ja_jp: データベースに接続できませんでした({0})、データベースの接続文字列を確認してください
ko_kr: ({0}) 데이터베이스에 연결하지 못했습니다. 연결 정보를 확인하십시오.
ru_ru: Не удалось подключиться к базе данных ({0}), пожалуйста, проверьте строку подключения к базе данных
vi_vn: Không thể kết nối tới cơ sở dữ liệu ({0}), vui lòng kiểm tra database connection string.
zh_cn: 数据库连接失败，请检查数据库连接字符串配置
zh_tw: 資料庫連接失敗({0})，請檢查資料庫連接字符串配置

# Database_CurrentConnectionString
source: Current connection string: {0}
de_de: Aktuelle Verbindungszeichenfolge: {0}
es_es: Cadena de conexión actual: {0}
fr_fr: Chaîne de connexion actuelle : {0}
id_id: String koneksi saat ini: {0}
ja_jp: 使っているデータベースの接続文字列：{0}
ko_kr: 현재 연결 정보: {0}
ru_ru: Текущая строка подключения: {0}
vi_vn: Database connection string hiện tại: {0}
zh_cn: 当前连接字符串：{0}
zh_tw: 當前連接字符串：{0}

# Database_NoConnectionString
source: The database connection string field 'ConnectionStrings' was not found, please check if appsettings.json has been properly mounted and configured
de_de: Das Feld ‚ConnectionStrings‘ für die Datenbank-Verbindungszeichenfolge wurde nicht gefunden, bitte prüfen Sie, ob appsettings.json korrekt eingebunden und konfiguriert ist
es_es: No se encontró el campo de cadena de conexión de la base de datos 'ConnectionStrings', por favor verifique si appsettings.json ha sido montado y configurado correctamente
fr_fr: Le champ de chaîne de connexion à la base de données 'ConnectionStrings' n'a pas été trouvé, veuillez vérifier si appsettings.json a été correctement monté et configuré
id_id: Field string koneksi database 'ConnectionStrings' tidak ditemukan, silakan periksa apakah appsettings.json sudah dipasang dan dikonfigurasi dengan benar
ja_jp: データベースの接続文字列フィールド 'ConnectionStrings' が検出されていませんでした、appsettings.json が正しくマウントおよび設定されていますでしょうか？
ko_kr: 데이터베이스 연결 정보 중 'ConnectionStrings' 를 찾지 못했습니다. appsettings.json 을 확인하십시오.
ru_ru: Поле строки подключения к базе данных 'ConnectionStrings' не было найдено, пожалуйста проверьте правильность установки и конфигурации appsettings.json
vi_vn: Không tìm thấy trường 'ConnectionStrings'. Hãy chắc rằng appsettings.json đã được cấu hình và mount đúng cách
zh_cn: 未找到数据库连接字符串字段 'ConnectionStrings'，请检查 appsettings.json 是否正常挂载及配置
zh_tw: 未找到資料庫連接字符串欄位 'ConnectionStrings'，請檢查 appsettings.json 是否正常掛載及配置

# FileRepository_CacheLocation
source: Cache location: {0}
de_de: Cache-Ort: {0}
es_es: Ubicación de la caché: {0}
fr_fr: Emplacement du cache : {0}
id_id: Lokasi cache: {0}
ja_jp: キャッシュの場所：{0}
ko_kr: 캐시 위치: {0}
ru_ru: Расположение кэша: {0}
vi_vn: Vị trí bộ đệm: {0}.
zh_tw: 緩存位置：{0}

# FileRepository_DeleteFile
source: Delete file [{0}] {1}
de_de: Datei löschen [{0}] {1}
es_es: Eliminar archivo [{0}] {1}
fr_fr: Supprimer le fichier [{0}] {1}
id_id: Menghapus file [{0}] {1}
ja_jp: ファイル [{0}] {1} を削除します
ko_kr: 파일 삭제 [{0}] {1}
ru_ru: Удаление файла: [{0}] {1}
vi_vn: Xóa tệp [{0}] {1}.
zh_tw: 刪除文件 [{0}] {1}

# FileRepository_ImageSaveFailed
source: Unable to save image: {0}
de_de: Bild konnte nicht gespeichert werden: {0}
es_es: No se puede guardar la imagen: {0}
fr_fr: Impossible de sauvegarder l'image : {0}
id_id: Gagal menyimpan gambar: {0}
ja_jp: 画像ファイルを保存できませんでした：{0}
ko_kr: 이미지 저장 실패: {0}
ru_ru: Не удалось сохранить изображение: {0}
vi_vn: Không thể lưu image: {0}.
zh_tw: 無法存儲圖像文件：{0}

# FileRepository_ReferenceCounting
source: File reference count [{0}] {1} => {2}
de_de: Dateireferenzzähler [{0}] {1} => {2}
es_es: Conteo de referencia del archivo [{0}] {1} => {2}
fr_fr: Compte de référence de fichier [{0}] {1} => {2}
id_id: Jumlah referensi file [{0}] {1} => {2}
ja_jp: ファイルイン参照数 [{0}] {1} => {2}
ko_kr: 파일 참조 수 [{0}] {1} = > {2}
ru_ru: Число ссылок на файл [{0}] {1} => {2}
vi_vn: Đếm tham chiếu tệp [{0}] {1} => {2}.
zh_tw: 文件引用計數 [{0}] {1} => {2}

# File_DeletionFailed
source: Failed to delete file
de_de: Fehler beim Löschen der Datei
es_es: Error al eliminar el archivo
fr_fr: Échec de la suppression du fichier
id_id: Gagal menghapus file
ja_jp: ファイルを削除できませんでした
ko_kr: 파일 삭제 실패
ru_ru: Не удалось удалить файл
vi_vn: Không thể xóa tệp.
zh_tw: 文件刪除失敗

# File_NotFound
source: File not exists
de_de: Datei existiert nicht
es_es: Archivo no existe
fr_fr: Fichier non existant
id_id: File tidak tersedia
ja_jp: ファイルは存在しません
ko_kr: 파일이 존재하지 않습니다.
ru_ru: Файл не найден
vi_vn: Tệp không tồn tại.
zh_tw: 文件不存在

# File_PdfOnly
source: Please upload a PDF file
de_de: Bitte laden Sie eine PDF-Datei hoch
es_es: Por favor suba un archivo PDF
fr_fr: Veuillez télécharger un fichier PDF
id_id: Mohon upload file PDF
ja_jp: PDF ファイルをアップロードしてください
ko_kr: PDF 파일을 업로드해주십시오.
ru_ru: Пожалуйста, загрузите PDF-файл
vi_vn: Vui lòng tải lên tệp PDF.
zh_tw: 請上傳 pdf 文件

# File_SizeTooLarge
source: File too large
de_de: Datei zu groß
es_es: Archivo demasiado grande
fr_fr: Fichier trop volumineux
id_id: File terlalu besar
ja_jp: ファイルが大きすぎます
ko_kr: 파일이 너무 큽니다!
ru_ru: Файл слишком большой
vi_vn: Kích thước tệp quá lớn.
zh_tw: 文件過大

# File_SizeZero
source: Invalid file
de_de: Ungültige Datei
es_es: Archivo inválido
fr_fr: Fichier invalide
id_id: File tidak valid
ja_jp: 無効なファイルです
ko_kr: 유효하지 않은 파일
ru_ru: Недопустимый файл
vi_vn: Tệp không hợp lệ.
zh_tw: 文件非法

# FlagChecker_AnswerAccepted
source: [AC] Team [{0}] submitted the answer [{2}] for challenge [{1}]
de_de: [AC] Team [{0}] hat die Antwort [{2}] für die Herausforderung [{1}] eingereicht
es_es: [AC] El equipo [{0}] presentó la respuesta [{2}] para el desafío [{1}]
fr_fr: [AC] Équipe [{0}] a soumis la réponse [{2}] pour le défi [{1}]
id_id: [AC] Tim [{0}] mengirim jawaban [{2}] untuk challenge [{1}]
ja_jp: [正しい回答] チーム [{0}] はチャレンジ [{1}] の回答 [{2}] を提出しました
ko_kr: [AC] [{0}] 팀이 [{1}] 문제 답으로 [{2}] 를 제출했습니다
ru_ru: [AC] Команда [{0}] предоставила верный ответ [{2}] на задание [{1}]
vi_vn: [AC] Đội [{0}] đã nộp câu trả lời [{2}] cho thử thách [{1}].
zh_tw: [提交正確] 隊伍 [{0}] 提交題目 [{1}] 的答案 [{2}]
