Repository: GZTimeWalker/GZCTF
Catalog: src/GZCTF/Resources/Program.*.resx
Languages: de_de, es_es, fr_fr, id_id, ja_jp, ko_kr, ru_ru, vi_vn, zh_cn, zh_tw

# Game_CreationFailed
source: Failed to create game
de_de: Fehler beim Erstellen des Spiels
es_es: Error al crear el juego
fr_fr: Échec de création du jeu
id_id: Gagal membuat game
ja_jp: ゲームの作成に失敗しました
ko_kr: 게임 생성 실패
ru_ru: Не удалось создать игру
vi_vn: Không thể tạo trò chơi
zh_tw: 比賽創建失敗

# Challenge_CaptureNotAllowed
source: Enable traffic capture only for challenge with containers
de_de: Erfassen von Verkehr nur für Herausforderungen mit Containern aktivieren
es_es: Habilitar captura de tráfico solo para desafíos con contenedores
fr_fr: Activer la capture de trafic uniquement pour le défi avec des conteneurs
id_id: Aktifkan penangkapan traffic untuk challenge dengan container
ja_jp: トラフィックキャプチャを使用できるのはコンテナチャレンジのみです
ko_kr: 컨테이너 문제에만 트래픽 캡처를 허용할 수 있습니다.
ru_ru: Включить захват трафика только для заданий с контейнерами
vi_vn: Chỉ bật bắt lưu lượng cho các thử thách có container
zh_tw: 只有容器題目可以進行流量捕獲

# Challenge_DynamicAssetsNotNullable
source: Dynamic attachment name cannot be empty
de_de: Dynamischer Anhangsname darf nicht leer sein
es_es: El nombre del adjunto dinámico no puede estar vacío
fr_fr: Le nom de pièce jointe dynamique ne peut pas être vide
id_id: Dynamic attachment tidak boleh kosong
ja_jp: 動的添付名は空にはできません
ko_kr: 동적 인스턴스 이름을 적어주세요.
ru_ru: Имя динамического вложения не может быть пустым
vi_vn: Tên file đính kèm động không được để trống
zh_tw: 動態附件名不可為空

# Challenge_FlagTooTrivial
source: Flag is not sufficiently complicated, please consider adding team hash or adding length
de_de: Flagge ist nicht ausreichend kompliziert, bitte in Betracht ziehen, Team-Hash oder Länge hinzuzufügen
es_es: La bandera no es lo suficientemente complicada, por favor considere agregar un hash de equipo o aumentar la longitud
fr_fr: Le drapeau n'est pas suffisamment compliqué, veuillez envisager d'ajouter un hash d'équipe ou d'augmenter la longueur
id_id: Flag tidak cukup rumit, harap pertimbangkan untuk menambahkan hash tim atau menambah panjang flagnya
ja_jp: フラッグの複雑性は不十分です。チームハッシュを追加するか長さを増やすことを検討してください。
ko_kr: 플래그가 충분히 복잡하지 않습니다. 해시값을 추가하거나 길이를 늘리세요
ru_ru: Флаг недостаточно сложен, удлините флаг или добавьте хеш команды к флагу
vi_vn: Flag không đủ phức tạp, hãy xem xét thêm team hash hoặc tăng độ dài
zh_tw: flag 複雜度不足，請考慮添加隊伍哈希或增加長度

# Challenge_NoFlag
source: The challenge has no flag and cannot be enabled
de_de: Die Herausforderung hat keine Flagge und kann nicht aktiviert werden
es_es: El desafío no tiene bandera y no se puede habilitar
fr_fr: Le défi n'a pas de drapeau et ne peut pas être activé
id_id: Challenge tidak memiliki flag dan tidak dapat diaktifkan
ja_jp: チャレンジは フラッグがないため使用できません
ko_kr: 문제에 플래그가 설정되지 않았습니다.
ru_ru: Задание не имеет флагов и не может быть активировано
vi_vn: Thử thách không có flag và không thể kích hoạt
zh_tw: 題目無 flag，不可啟用

# Challenge_UseAssetsApiForDynamic
source: Use assets API to upload attachments
de_de: Verwenden Sie die Assets-API, um Anhänge hochzuladen
es_es: Use la API de activos para subir adjuntos
fr_fr: Utilisez l'API des actifs pour télécharger les pièces jointes
id_id: Gunakan aset API untuk mengunggah lampiran
ja_jp: 動的添付チャレンジについては、Assets API を使用して添付ファイルをアップロードしてください。
ko_kr: assets API 를 이용하여 첨부 파일을 업로드하세요.
ru_ru: Используйте assets API для загрузки вложений
vi_vn: Sử dụng API assets để tải lên file đính kèm
zh_tw: 動態附件題目請使用 assets API 上傳附件

# Container_AddressResolveFailed
source: Container address parse failed
de_de: Containeradresse konnte nicht geparst werden
es_es: Fallo en el análisis de la dirección del contenedor
fr_fr: Échec de l'analyse de l'adresse du conteneur
id_id: Gagal mem-parsing alamat container
ja_jp: コンテナのアドレスを解析できませんでした
ko_kr: 컨테이너 주소가 잘못되었습니다.
ru_ru: Не удалось разобрать адрес контейнера
vi_vn: Không phân giải được địa chỉ container
zh_tw: 容器地址解析失敗

# Container_ConfigError
source: Container Configuration Error
de_de: Container-Konfigurationsfehler
es_es: Error de configuración del contenedor
fr_fr: Erreur de configuration du conteneur
id_id: Konfigurasi container error
ja_jp: コンテナ構成エラー
ko_kr: 컨테이너 설정 오류
ru_ru: Ошибка конфигурации контейнера
vi_vn: Lỗi cấu hình container
zh_tw: 容器配置錯誤

# Container_ConnectionLimitExceeded
source: Container connection limit reached
de_de: Container-Verbindungslimit erreicht
es_es: Límite de conexiones del contenedor alcanzado
fr_fr: Limite de connexion au conteneur atteinte
id_id: Batas koneksi container sudah tercapai
ja_jp: コンテナ接続の上限に達しています
ko_kr: 컨테이너 연결 수 최대치 도달
ru_ru: Достигнут лимит подключений для контейнера
vi_vn: Đã đạt giới hạn kết nối của container
zh_tw: 容器連接數已達上限

# Container_CreationFailed
source: Failed to create container
de_de: Container konnte nicht erstellt werden
es_es: Error al crear el contenedor
fr_fr: Échec de la création du conteneur
id_id: Gagal membuat container
ja_jp: コンテナを作成できませんでした
ko_kr: 컨테이너 생성 실패
ru_ru: Не удалось создать контейнер
vi_vn: Không thể tạo container
zh_tw: 容器創建失敗

# Container_InvalidClientAddress
source: Invalid access address
de_de: Ungültige Zugriffsadresse
es_es: Dirección de acceso inválida
fr_fr: Adresse d'accès invalide
id_id: Alamat akses tidak valid
ja_jp: 無効なアクセスアドレス
ko_kr: 유효하지 않은 주소
ru_ru: Неверный адрес доступа
vi_vn: Địa chỉ truy cập không hợp lệ
zh_tw: 無效的訪問地址

# Container_InvalidPort
source: Invalid port when creating a container
de_de: Ungültiger Port bei der Erstellung eines Containers
es_es: Puerto inválido al crear un contenedor
fr_fr: Port invalide lors de la création d'un conteneur
id_id: Port tidak valid saat membuat container
ja_jp: コンテナの作成中に無効なポートを遭遇しました
ko_kr: 잘못된 port
ru_ru: Неверный порт при создании контейнера
vi_vn: Cổng không hợp lệ khi tạo container
zh_tw: 創建容器時遇到無效的埠

# Container_NotFound
source: Container does not exist
de_de: Container existiert nicht
es_es: El contenedor no existe
fr_fr: Le conteneur n'existe pas
id_id: Container tidak ditemukan
ja_jp: コンテナが存在しません
ko_kr: 컨테이너가 존재하지 않습니다.
ru_ru: Контейнер не существует
vi_vn: Container không tồn tại
zh_tw: 不存在的容器

# Container_TestContainerCreated
source: Successfully created test container {0}
de_de: Testcontainer {0} erfolgreich erstellt
es_es: Contenedor de prueba {0} creado con éxito
fr_fr: Conteneur de test {0} créé avec succès
id_id: Container percobaan {0} berhasil dibuat
ja_jp: テストコンテナ {0} を正常に作成しました
ko_kr: 테스트 컨테이너 {0} 생성 성공
ru_ru: Тестовый контейнер {0} успешно создан
vi_vn: Đã tạo thành công container thử nghiệm {0}
zh_tw: 成功創建測試容器 {0}

# File_CreationFailed
source: Failed to create file
de_de: Datei konnte nicht erstellt werden
es_es: Error al crear el archivo
fr_fr: Échec de la création du fichier
id_id: Gagal membuat file
ja_jp: ファイルを作成できませんでした
ko_kr: 파일 생성 실패
ru_ru: Не удалось создать файл
vi_vn: Không thể tạo file
zh_tw: 文件創建失敗

source: Notification not found
de_de: Benachrichtigung nicht gefunden
es_es: Notificación no encontrada
fr_fr: Notification introuvable
id_id: Notifikasi tidak ditemukan
ja_jp: 通知が見つかりませんでした
ko_kr: 공지사항을 찾을 수 없습니다.
ru_ru: Уведомление не найдено
vi_vn: Không tìm thấy thông báo
zh_tw: 通知未找到

# Notification_SystemNotDeletable
source: System notifications could not be deleted
de_de: Systembenachrichtigungen konnten nicht gelöscht werden
es_es: No se pudieron eliminar las notificaciones del sistema
fr_fr: Les notifications système ne peuvent pas être supprimées
id_id: Notifikasi sistem tidak bisa dihapus
ja_jp: システム通知は削除できません
ko_kr: 시스템 공지사항을 삭제할 수 없습니다.
ru_ru: Системные уведомления не могут быть удалены
vi_vn: Thông báo hệ thống không thể bị xóa
zh_tw: 不能刪除系統通知

# Notification_SystemNotEditable
source: System notifications cannot be modified
de_de: Systembenachrichtigungen können nicht bearbeitet werden
es_es: No se pueden modificar las notificaciones del sistema
fr_fr: Les notifications système ne peuvent pas être modifiées
id_id: Notifikasi sistem tidak dapat diubah
ja_jp: システム通知を変更できません
ko_kr: 시스템 공지사항을 수정할 수 없습니다.
ru_ru: Системные уведомления не могут быть изменены
vi_vn: Thông báo hệ thống không thể bị thay đổi
zh_tw: 不能更改系統通知

# Proxy_ContainerConnectionFailed
source: Failed to connect to the container ({0})
de_de: Verbindung zum Container fehlgeschlagen ({0})
es_es: Error al conectar con el contenedor ({0})
fr_fr: Échec de la connexion au conteneur ({0})
id_id: Gagal terhubung ke container ({0})
ja_jp: コンテナへの接続に失敗しました ({0})
ko_kr: 컨테이너 ({0}) 접속 실패
ru_ru: Не удалось подключиться к контейнеру ({0})
vi_vn: Không thể kết nối đến container ({0}).
zh_tw: 容器連接失敗（{0}）

# Proxy_ContainerConnectionFailedLog
source: Container connection failed ({0}), may be starting up or check network configuration -> {1}
de_de: Containerverbindung fehlgeschlagen ({0}), möglicherweise wird gestartet oder Netzwerkkonfiguration prüfen -> {1}
es_es: Fallo en la conexión al contenedor ({0}), puede estar iniciándose o revise la configuración de red -> {1}
fr_fr: Échec de la connexion au conteneur ({0}), peut être en train de démarrer ou vérifier la configuration réseau -> {1}
id_id: Koneksi ke container gagal ({0}), mungkin sedang dalam proses startup atau periksa konfigurasi jaringan -> {1}
ja_jp: コンテナへの接続に失敗しました ({0})。起動中であるか、ネットワーク構成を確認してください -> {1}
ko_kr: 컨테이너 접속 실패 ({0}), 시작 중이거나 네트워크 설정을 확인하세요. - > {1}
ru_ru: Ошибка связи с контейнером ({0}), возможно, он запускается, либо необходимо проверить настройки сети -> {1}
vi_vn: Kết nối container thất bại ({0}), có thể đang khởi động hoặc kiểm tra cấu hình mạng -> {1}.
zh_tw: 容器連接失敗（{0}），可能正在啟動中或請檢查網絡配置 -> {1}

# Proxy_Error
source: An error occurred during the proxy process
de_de: Ein Fehler ist während des Proxy-Prozesses aufgetreten
es_es: Ocurrió un error durante el proceso del proxy
fr_fr: Une erreur s'est produite lors du processus proxy
id_id: Terjadi kesalahan selama proses proxy
ja_jp: プロキシ処理中にエラーが発生しました
ko_kr: 프록시 오류 발생
ru_ru: Произошла ошибка во время проксирования
vi_vn: Đã xảy ra lỗi trong proxy process.
zh_tw: 代理過程發生錯誤

# Proxy_TcpDisabled
source: TCP proxy is disabled
de_de: TCP-Proxy ist deaktiviert
es_es: El proxy TCP está deshabilitado
fr_fr: Le proxy TCP est désactivé
id_id: TCP proxy dinonaktifkan
ja_jp: TCP プロキシは無効になっています
ko_kr: TCP 프록시 비활성화됨
ru_ru: TCP-прокси отключен
vi_vn: Proxy TCP đã bị tắt.
zh_tw: TCP 代理已禁用

# Team_AvatarUpdated
source: Team {0} changed avatar: [{1}]
de_de: Team {0} hat das Avatar geändert: [{1}]
es_es: El equipo {0} cambió el avatar: [{1}]
fr_fr: Équipe {0} a changé d'avatar : [{1}]
id_id: Tim {0} mengganti avatar: [{1}]
ja_jp: チーム {0} はアバターを更新しました：[{1}]
ko_kr: {0} 팀이 아바타를 변경함: [{1}]
ru_ru: Команда {0} изменила аватар: [{1}]
vi_vn: Đội {0} đã thay đổi ảnh đại diện: [{1}].
zh_tw: 隊伍 {0} 更改新頭像：[{1}]

source: Team avatar update failed
de_de: Aktualisierung des Team-Avatars fehlgeschlagen
es_es: La actualización del avatar del equipo falló
fr_fr: Échec de la mise à jour de l'avatar de l'équipe
id_id: Avatar tim gagal diperbarui
ja_jp: チームアバターの更新に失敗しました
ko_kr: 팀 아바타 업데이트 실패
ru_ru: Не удалось обновить аватар команды
vi_vn: Cập nhật ảnh đại diện đội thất bại.
zh_tw: 隊伍頭像更新失敗

# Team_Created
source: Create team {0}
de_de: Team {0} erstellen
es_es: Crear equipo {0}
fr_fr: Créer l'équipe {0}
id_id: Buat team {0}
ja_jp: チーム {0} が作成されました
ko_kr: {0} 팀 생성
ru_ru: Создание команды {0}
vi_vn: Tạo đội {0}.
zh_tw: 創建隊伍 {0}

source: Team creation failed
de_de: Teamerstellung fehlgeschlagen
es_es: La creación del equipo falló
fr_fr: Échec de la création de l'équipe
id_id: Pembuatan tim gagal
ja_jp: チームを作成できませんでした
ko_kr: 팀 생성 실패
ru_ru: Не удалось создать команду
vi_vn: Tạo đội thất bại.
zh_tw: 隊伍創建失敗

# Team_Deleted
source: Delete team {0}
de_de: Team {0} löschen
es_es: Eliminar equipo {0}
fr_fr: Supprimer l'équipe {0}
id_id: Hapus team {0}
ja_jp: チーム {0} が削除されました
ko_kr: {0} 팀 삭제
ru_ru: Удаление команды {0}
vi_vn: Xóa đội {0}.
zh_tw: 刪除隊伍 {0}

# Team_IdTransformFailed
source: Team Id conversion error：{0}
de_de: Team-ID-Konvertierungsfehler：{0}
es_es: Error de conversión de Id del equipo：{0}
fr_fr: Erreur de conversion de l'ID d'équipe : {0}
id_id: Kesalahan konversi Id tim: {0}
ja_jp: チーム ID 変換エラー：{0}
ko_kr: 팀 Id 변환 오류 : {0}
ru_ru: Ошибка преобразования Id команды：{0}
vi_vn: Lỗi chuyển đổi ID đội: {0}.
zh_tw: 隊伍 Id 轉換錯誤：{0}

# Team_InvalidCode
source: Invalid code
de_de: Ungültiger Code
es_es: Código no válido
fr_fr: Code invalide
id_id: Kode tidak valid
ja_jp: コードが無効です
ko_kr: 유효하지 않은 코드
ru_ru: Неверный код
vi_vn: Mã không hợp lệ.
zh_tw: Code 無效

# Team_Locked
source: Team is locked
de_de: Team ist gesperrt
es_es: El equipo está bloqueado
fr_fr: L'équipe est verrouillée
id_id: Tim terkunci
ja_jp: チームはロックされています
ko_kr: 팀 잠금됨
ru_ru: Команда закрыта
vi_vn: Đội đã bị khóa.
zh_tw: 隊伍已鎖定

# Team_MemberRemoved
source: Kick {0} from Team {1}
de_de: {0} aus Team {1} entfernen
es_es: Expulsar {0} del Equipo {1}
fr_fr: Exclure {0} de l'équipe {1}
id_id: Kick {0} dari tim {1}
ja_jp: チーム {0} から {1} を追放しました
ko_kr: {1} 팀에서 {0} 방출
ru_ru: {0} выгнан из команды {1}
vi_vn: Đã xóa {0} khỏi đội {1}.
zh_tw: 從隊伍 {0} 踢除 {1}

# Team_MultipleCreationNotAllowed
source: Not allowed creating more than one team
ja_jp: 複数のチームを作成することはできません

# Team_NameEmpty
source: Team name cannot be empty
de_de: Teamname darf nicht leer sein
es_es: El nombre del equipo no puede estar vacío
fr_fr: Le nom de l'équipe ne peut pas être vide
id_id: Nama tim tidak boleh kosong
ja_jp: チーム名は空にできません
ko_kr: 팀 이름을 입력하세요.
ru_ru: Название команды не может быть пустым
vi_vn: Tên đội không được để trống.
zh_tw: 隊伍名不能為空

# Team_NameInvalidInvitation
source: {0} invitation is invalid
de_de: {0} Einladung ist ungültig
es_es: La invitación {0} no es válida
fr_fr: L'invitation {0} est invalide
id_id: Undangan {0} tidak valid
ja_jp: {0} からの招待は無効です
ko_kr: 유효하지 않은 초대 {0}
ru_ru: Приглашение {0} недействительно
vi_vn: Lời mời {0} không hợp lệ.
zh_tw: {0} 邀請無效

# Team_NameLocked
source: The team {0} is locked
de_de: Das Team {0} ist gesperrt
es_es: El equipo {0} está bloqueado
fr_fr: L'équipe {0} est verrouillée
id_id: Tim {0} terkunci
ja_jp: チーム {0} はロックされています
ko_kr: {0} 팀 잠금됨
ru_ru: Команда {0} закрыта
vi_vn: Đội {0} đã bị khóa.
zh_tw: {0} 隊伍已鎖定

# Team_NameNotFound
source: Team {0} not found
de_de: Team {0} nicht gefunden
es_es: Equipo {0} no encontrado
fr_fr: Équipe {0} introuvable
id_id: Tim {0} tidak ditemukan
ja_jp: チーム {0} は見つかりませんでした
ko_kr: {0} 팀을 찾을 수 없습니다.
ru_ru: Команда {0} не найдена
vi_vn: Không tìm thấy đội {0}.
zh_tw: {0} 隊伍未找到

# Team_NewCaptainNotFound
source: Transferred user does not exist
de_de: Der übertragene Benutzer existiert nicht
es_es: El usuario transferido no existe
fr_fr: L'utilisateur transféré n'existe pas
id_id: Pengguna yang dipindahkan tidak ada
ja_jp: 移送先のユーザーは存在しません
ko_kr: 사용자가 존재하지 않습니다.
ru_ru: Указанный пользователь не найден
vi_vn: Người dùng được chuyển giao không tồn tại.
zh_tw: 移交的用戶不存在

# Team_NewCaptainTeamTooMany
source: Too many handed over teams
de_de: Der neue Kapitän hat zu viele Teams
es_es: El nuevo capitán tiene demasiados equipos
fr_fr: Le nouveau capitaine a trop d'équipes
id_id: Kapten baru memiliki terlalu banyak tim
ja_jp: 移送先が管理しているチームが多すぎます
ko_kr: 새 팀장이 너무 많은 팀에 소속되어있습니다.
ru_ru: Новый капитан владеет максимальным количеством команд
vi_vn: Đội trưởng mới đang có quá nhiều đội
zh_tw: 被移交者所管理的隊伍過多

# Team_UserJoined
source: Join Team {0}
de_de: Team {0} beitreten
es_es: Unirse al Equipo {0}
fr_fr: Rejoindre l'équipe {0}
id_id: Bergabun dengan tim {0}
ja_jp: チーム {0} に参加しました
ko_kr: {0} 팀에 참가
ru_ru: Вступил в команду {0}
vi_vn: Tham gia đội {0}.
zh_tw: 加入隊伍 {0}

# Team_UserLeft
source: Left the team {0}
de_de: Das Team {0} verlassen
es_es: Dejó el equipo {0}
fr_fr: A quitté l'équipe {0}
id_id: Keluar dari tim {0}
ja_jp: チーム {0} から離れました
ko_kr: {0} 팀 나가기
ru_ru: Покинул команду {0}
vi_vn: Rời đội {0}.
zh_tw: 離開隊伍 {0}

# User_AlreadyInTeam
source: You have already joined this team, no need to join again
de_de: Sie haben diesem Team bereits beigetreten, es ist nicht nötig, erneut beizutreten
es_es: Ya te has unido a este equipo, no necesitas unirte de nuevo
fr_fr: Vous avez déjà rejoint cette équipe, pas besoin de rejoindre à nouveau
id_id: Kamu sudah bergabung dengan tim ini, tidak perlu bergabung lagi
ja_jp: すでにこのチームに参加しています。重複して参加する必要はありません。
ko_kr: 이미 해당 팀에 있습니다.
ru_ru: Вы уже вступили в эту команду
vi_vn: Bạn đã tham gia đội này, không cần tham gia lại.
zh_tw: 你已經加入此隊伍，無需重複加入

# User_LeaveNotInTeam
source: You are not in this team and cannot leave
de_de: Sie sind nicht in diesem Team und können nicht verlassen
es_es: No estás en este equipo y no puedes salir
fr_fr: Vous n'êtes pas dans cette équipe et ne pouvez pas quitter
id_id: Kamu tidak ada di tim ini dan tidak bisa keluar
ja_jp: このチームに参加していないため、チームから離れることはできません
ko_kr: 해당 팀에 있지 않습니다.
ru_ru: Вы не состоите в этой команде и не можете её покинуть
vi_vn: Bạn không thuộc đội này nên không thể rời.
zh_tw: 你不在此隊伍中，無法離隊

# User_NotInTeam
source: User not in the team
de_de: Benutzer nicht im Team
es_es: Usuario no está en el equipo
fr_fr: L'utilisateur n'est pas dans l'équipe
id_id: Pengguna tidak didalam tim
ja_jp: ユーザーはチームに属していません
ko_kr: 해당 팀에 있지 않습니다.
ru_ru: Пользователь не вступил в команду
vi_vn: Người dùng không thuộc đội.
zh_tw: 用戶不在隊伍中

# Game_WriteupNotNeeded
source: This match cannot be submitted
de_de: Schreiben ist für dieses Spiel deaktiviert.
es_es: La redacción está desactivada para este juego.
fr_fr: La rédaction est désactivée pour ce jeu.
id_id: Writeup di nonaktifkan pada game ini.
ja_jp: このゲームは記事を提出することができません
ko_kr: 이 게임은 Writeup 을 제출하지 않아도 됩니다.
ru_ru: Отчеты для этой игры отключены.
vi_vn: Writeup đã bị tắt cho trò chơi này.
zh_tw: 本次比賽不可提交 Writeup

# Signature_Invalid
source: Invalid signature
de_de: Ungültige Signatur
es_es: Firma inválida
fr_fr: Signature invalide
id_id: Signature tidak valid
ja_jp: 無効な署名
ko_kr: 유효하지 않은 시그니처
ru_ru: Неверная подпись
vi_vn: Chữ ký không hợp lệ.
zh_tw: 無效的籤名

# Game_End
source: The game has ended
zh_cn: 比赛已结束
