Repository: GZTimeWalker/GZCTF
Catalog: src/GZCTF/Resources/Program.*.resx
Languages: de_de, es_es, fr_fr, id_id, ja_jp, ko_kr, ru_ru, vi_vn, zh_cn, zh_tw

# Account_AvailableEmailDomain
source: Available email suffix: {0}
de_de: Verfügbares E-Mail-Suffix: {0}
es_es: Sufijo de correo electrónico disponible: {0}
fr_fr: Suffixe de l'email disponible : {0}
id_id: Akhiran alamat email yang tersedia: {0}
ja_jp: 有効なメールドメイン：{0}
ko_kr: 사용 가능한 이메일 접미사: {0}
ru_ru: Доступен почтовый домен: {0}
vi_vn: Email domain: {0}
zh_tw: 可用郵箱後綴：{0}

# Account_AvatarUpdated
source: Change new avatar: [{0}]
de_de: Neuen Avatar ändern: [{0}]
es_es: Cambiar nuevo avatar: [{0}]
fr_fr: Changer le nouvel avatar : [{0}]
id_id: Ganti avaratar baru: [{0}
ja_jp: アバターを変更しました：[{0}]
ko_kr: 아바타 변경하기: [{0}]
ru_ru: Изменение аватара: [{0}]
vi_vn: Thay đổi ảnh đại diện: [{0}]
zh_tw: 更改新頭像：[{0}]

# Account_ChangeEmailFromAdmin
source: Please contact the administrator to change the email
de_de: Bitte kontaktieren Sie den Administrator, um die E-Mail zu ändern
es_es: Por favor, contacta al administrador para cambiar el correo electrónico
fr_fr: Veuillez contacter l'administrateur pour changer l'email
id_id: Harap hubungi administrator untuk merubah alamat email anda
ja_jp: メールによる認証は有効化していません、メールアドレスを変更するには管理者にお問い合わせください。
ko_kr: 이메일을 변경하려면 관리자에게 문의하세요.
ru_ru: Свяжитесь с администратором для изменения электронной почты
vi_vn: Vui lòng liên hệ quản trị viên để thay đổi email
zh_tw: 請聯繫管理員修改郵箱

# Account_EmailChanged
source: Email changed successfully
de_de: E-Mail erfolgreich geändert
es_es: Correo electrónico cambiado con éxito
fr_fr: Email changé avec succès
id_id: Perubahan alamat email berhasil
ja_jp: メールを正常に変更しました
ko_kr: 이메일이 성공적으로 변경되었습니다.
ru_ru: Электронная почта успешно изменена
vi_vn: Thay đổi email thành công
zh_tw: 更改郵箱成功

# Account_EmailNotConfirmed
source: Account not activated, please register again
de_de: Konto nicht aktiviert, bitte erneut registrieren
es_es: Cuenta no activada, por favor regístrate nuevamente
fr_fr: Compte non activé, veuillez vous inscrire à nouveau
id_id: Akun belum aktif, silakan daftar lagi
ja_jp: アカウントは有効化されていません。もう一度登録してください。
ko_kr: 계정이 활성화되지 않았습니다. 다시 등록하십시오
ru_ru: Аккаунт не активирован, зарегистрируйтесь снова
vi_vn: Tài khoản chưa được kích hoạt, vui lòng đăng nhập lại
zh_tw: 帳戶未激活，請重新註冊

# Account_EmailSendFailed
source: Unable to send email, please contact the administrator
de_de: E-Mail kann nicht gesendet werden, bitte kontaktieren Sie den Administrator
es_es: No se pudo enviar el correo electrónico, por favor contacta al administrador
fr_fr: Impossible d'envoyer l'email, veuillez contacter l'administrateur
id_id: Gagal mengirim email, silakan hubungi admin
ja_jp: メールを送信できませんでした。システム管理者に連絡してください。
ko_kr: 이메일을 보낼 수 없습니다. 관리자에게 문의하세요
ru_ru: Ошибка отправки письма с подтверждением, свяжитесь с администратором
vi_vn: Không thể gửi email, vui lòng liên hệ quan trị viên
zh_tw: 郵件無法發送，請聯繫管理員

# Account_EmailSent
source: Email sent successfully
de_de: E-Mail erfolgreich gesendet
es_es: Correo electrónico enviado con éxito
fr_fr: Email envoyé avec succès
id_id: Pesan email berhasil terkirim
ja_jp: メールを送信しました
ko_kr: 이메일을 성공적으로 전송하였습니다.
ru_ru: Письмо отправлено
vi_vn: Gửi email thành công
zh_tw: 郵件發送成功

# Account_EmailUsed
source: Email address is already in use
de_de: E-Mail-Adresse wird bereits verwendet
es_es: La dirección de correo electrónico ya está en uso
fr_fr: L'adresse email est déjà utilisée
id_id: Alamat email sudah digunakan
ja_jp: メールは既に使用されています
ko_kr: 이미 사용 중인 이메일입니다.
ru_ru: Данная почта уже зарегистрирована
vi_vn: Địa chỉ email này đã được sử dụng
zh_tw: 郵箱已經被佔用

# Account_EmailVerificationFailed
source: Email verification failed
de_de: E-Mail-Verifikation fehlgeschlagen
es_es: Fallo en la verificación del correo electrónico
fr_fr: Échec de la vérification de l'email
id_id: Verifikasi alamat email gagal
ja_jp: メールの確認に失敗しました
ko_kr: 이메일 인증에 실패하였습니다.
ru_ru: Не удалось подтвердить адрес электронной почты
vi_vn: Xác minh email thất bại
zh_tw: 郵箱驗證失敗

# Account_EmailVerificationPending
source: Email pending verification
de_de: E-Mail-Verifikation ausstehend
es_es: Verificación del correo electrónico pendiente
fr_fr: Email en attente de vérification
id_id: Menunggu verifikasi email
ja_jp: メール確認待ち
ko_kr: 확인 대기 중인 이메일입니다.
ru_ru: Электронная почта ожидает подтверждения
vi_vn: Đang chờ xác nhận email
zh_tw: 郵箱待驗證

# Account_EmailVerified
source: Email verified
de_de: E-Mail verifiziert
es_es: Correo electrónico verificado
fr_fr: Email vérifié
id_id: Alamat email terverifikasi
ja_jp: メールを確認しました
ko_kr: 이메일 인증이 완료되었습니다.
ru_ru: Почта подтверждена
vi_vn: Email đã được xác nhận
zh_tw: 通過郵箱驗證

# Account_IncorrectUserNameOrPassword
source: Wrong username or password
de_de: Falscher Benutzername oder Passwort
es_es: Nombre de usuario o contraseña incorrectos
fr_fr: Nom d'utilisateur ou mot de passe incorrect
id_id: Nama pengguna atau kata sandi salah
ja_jp: ユーザー名またはパスワードが正しくありません
ko_kr: 잘못된 사용자 이름 또는 비밀번호 입니다.
ru_ru: Неверное имя пользователя или пароль
vi_vn: Tên hoặc mật khẩu không đúng
zh_tw: 用戶名或密碼錯誤

# Account_InvalidEmail
source: Invalid email address
de_de: Ungültige E-Mail-Adresse
es_es: Dirección de correo electrónico no válida
fr_fr: Adresse e-mail invalide
id_id: Alamat email tidak valid
ja_jp: 無効なメールアドレス
ko_kr: 잘못된 이메일 주소입니다.
ru_ru: Неверный адрес электронной почты
vi_vn: Địa chỉ email không hợp lệ
zh_tw: 無效的郵件地址

# Account_PasswordChanged
source: User updated password
de_de: Benutzer hat das Passwort aktualisiert
es_es: Usuario actualizó su contraseña
fr_fr: Utilisateur a mis à jour le mot de passe
id_id: Kata sandi berhasil diubah
ja_jp: ユーザーはパスワードを更新しました
ko_kr: 업데이트 할 계정 비밀번호
ru_ru: Пользователь изменил пароль
vi_vn: Người dùng đã thay đổi mật khẩu
zh_tw: 用戶更新密碼

# Account_PasswordReset
source: User password reset successful
de_de: Zurücksetzen des Benutzerpassworts erfolgreich
es_es: Restablecimiento de contraseña de usuario exitoso
fr_fr: Réinitialisation du mot de passe utilisateur réussie
id_id: Reset password pengguna berhasil
ja_jp: ユーザーはパスワードリセットに成功しました
ko_kr: 성공적으로 계정 비밀번호를 초기화하였습니다.
ru_ru: Пароль пользователя сброшен успешно
vi_vn: Thành công đổi mật khẩu người dùng
zh_tw: 用戶成功重置密碼

# Account_RegisterNotEnabled
source: Registration has been disabled
de_de: Registrierung wurde deaktiviert
es_es: El registro ha sido deshabilitado
fr_fr: L'enregistrement a été désactivé
id_id: Pendaftaran sudah di nonaktifkan
ja_jp: 登録機能は無効になっています
ko_kr: 등록이 비활성화 되었습니다.
ru_ru: Регистрация отключена
vi_vn: Quá trình đăng ký đã bị vô hiệu hóa
zh_tw: 註冊功能已禁用

# Account_ResetPasswordFromAdmin
source: Please contact the administrator to reset the password
de_de: E-Mail-Verifizierung ist nicht aktiviert, bitte kontaktieren Sie den Administrator, um das Passwort zurückzusetzen
es_es: La verificación por correo electrónico no está habilitada, por favor contacte al administrador para restablecer la contraseña
fr_fr: La vérification par email n'est pas activée, veuillez contacter l'administrateur pour réinitialiser le mot de passe
id_id: Verifikasi email belum diaktifkan, silakan hubungi admin untuk reset password
ja_jp: メールによる認証は有効化していません、パスワードをリセットするには管理者にお問い合わせてください
ko_kr: 이메일 인증이 활성화되어 있지 않습니다. 관리자에게 문의하여 비밀번호를 재설정하세요.
ru_ru: Подтверждение по электронной почте не включено, свяжитесь с администратором для сброса пароля
vi_vn: Xác minh email không khả dụng, vui lòng liên hệ quản trị viên để đặt lại mật khẩu
zh_tw: 平臺未開啟郵箱驗證功能，請聯繫管理員重置密碼

# Account_SendEmailChange
source: Send email to user for email change
de_de: Senden Sie dem Benutzer eine E-Mail zur E-Mail-Änderung
es_es: Enviar correo electrónico al usuario para cambiar de correo
fr_fr: Envoyer un email à l'utilisateur pour le changement d'email
id_id: Kirim email ke pengguna untuk perubahan alamat email
ja_jp: メールアドレスの更新メールを送信します
ko_kr: 이메일 변경을 위해 사용자에게 메일을 보냈습니다.
ru_ru: Отправка письма для изменения электронной почты
vi_vn: Gửi email cho người dùng để thay đổi email
zh_tw: 發送用戶郵箱更改郵件

# Account_SendEmailVerification
source: Send email to user for email verification
de_de: Senden Sie dem Benutzer eine E-Mail zur E-Mail-Verifizierung
es_es: Enviar correo electrónico al usuario para la verificación del correo
fr_fr: Envoyer un email à l'utilisateur pour la vérification d'email
id_id: Kirim email ke pengguna untuk verifikasi email
ja_jp: メールアドレスの確認メールを送信します
ko_kr: 이메일 확인을 위하여 사용자에게 이메일을 보냈습니다.
ru_ru: Отправка письма для подтверждения электронной почты
vi_vn: Gửi email cho người dùng để xác nhận email
zh_tw: 發送用戶郵箱驗證郵件

# Account_TokenValidationFailed
source: Captcha failed
de_de: Captcha fehlgeschlagen
es_es: Fallo en el captcha
fr_fr: Échec du captcha
id_id: Verifikasi captcha gagal
ja_jp: コードの認証に失敗しました
ko_kr: 인증에 실패하였습니다.
ru_ru: Ошибка Captcha
vi_vn: Xác minh captcha thất bại
zh_tw: 驗證碼校驗失敗

# Account_UserDisabled
source: User is disabled
de_de: Benutzer ist gesperrt
es_es: El usuario está prohibido
fr_fr: L'utilisateur est banni
id_id: Pengguna dibanned
ja_jp: アカウントは無効になっています
ko_kr: 사용자가 차단되었습니다.
ru_ru: Пользователь заблокирован
vi_vn: Người dùng đã bị cấm
zh_tw: 用戶已被禁用

# Account_UserExisting
source: This account already exists
de_de: Dieses Konto existiert bereits
es_es: Esta cuenta ya existe
fr_fr: Ce compte existe déjà
id_id: Akun ini sudah ada
ja_jp: アカウントはすでに存在しています
ko_kr: 이미 존재하는 계정입니다.
ru_ru: Такой аккаунт уже существует
vi_vn: Tài khoản này đã tồn tại
zh_tw: 此帳戶已存在

# Account_UserLogined
source: User successfully logged in
de_de: Benutzer erfolgreich eingeloggt
es_es: Usuario inició sesión con éxito
fr_fr: Utilisateur connecté avec succès
id_id: Pengguna berhasil login
ja_jp: ユーザーは正常にログインしました
ko_kr: 성공적으로 로그인 하였습니다.
ru_ru: Успешная авторизация
vi_vn: Người dùng đã đăng nhập thành công
zh_tw: 用戶成功登錄

# Account_UserNotExist
source: User does not exist
de_de: Benutzer existiert nicht
es_es: El usuario no existe
fr_fr: L'utilisateur n'existe pas
id_id: Pengguna tidak terdaftar
ja_jp: ユーザーが存在しません
ko_kr: 사용자가 존재하지 않습니다.
ru_ru: Пользователь не существует
vi_vn: Người dùng không tồn tại
zh_tw: 用戶不存在

# Account_UserRegistered
source: Successfully registered
de_de: Erfolgreich registriert
es_es: Registrado con éxito
fr_fr: Enregistré avec succès
id_id: Pendaftaran berhasil
ja_jp: 登録が完了しました
ko_kr: 성공적으로 회원가입을 했습니다.
ru_ru: Регистрация прошла успешно
vi_vn: Đăng ký thành công
zh_tw: 註冊成功

# Account_UserRegisteredLog
source: User successfully registered
de_de: Benutzer erfolgreich registriert
es_es: Usuario registrado con éxito
fr_fr: Utilisateur enregistré avec succès
id_id: Pendaftaran pengguna berhasil
ja_jp: ユーザーは正常に登録されました
ko_kr: 성공적으로 회원가입을 했습니다.
ru_ru: Пользователь успешно зарегистрировался
vi_vn: Người dùng đã đăng ký thành công
zh_tw: 用戶成功註冊

# Account_UserRegisteredWaitingApproval
source: Successfully registered, waiting for moderator approval
de_de: Erfolgreich registriert, wartet auf Moderatorgenehmigung
es_es: Registrado con éxito, esperando aprobación del moderador
fr_fr: Enregistré avec succès, en attente de l'approbation du modérateur
id_id: Pendaftaran berhasil, tunggu persetujuan moderator
ja_jp: 正常に登録されました。アカウントは管理者の承認後有効となります。
ko_kr: 성공적으로 회원가입이 되었으며 관리자 승인을 기다리고 있습니다.
ru_ru: Регистрация прошла успешно, ожидание одобрения от модератора
vi_vn: Đăng ký thành công, đang chờ kiểm duyệt viên phê duyệt
zh_tw: 註冊成功，等待管理員審核

# Account_UserRegisteredWaitingApprovalLog
source: User successfully registered, pending approval
de_de: Benutzer erfolgreich registriert, Genehmigung ausstehend
es_es: Usuario registrado con éxito, pendiente de aprobación
fr_fr: Utilisateur enregistré avec succès, en attente d'approbation
id_id: Pengguna berhasil terdaftar, menunggu persetujuan
ja_jp: 正常に登録されました。管理者に承認されるまでしばらくお待ちください。
ko_kr: 계정이 성공적으로 등록되었으며 승인 대기 중입니다.
ru_ru: Пользователь успешно зарегистрировался, ожидание одобрения
vi_vn: Người dùng đã đăng ký thành công, đang chờ phê duyệt
zh_tw: 用戶成功註冊，待審核

# Account_UserRegisteredWaitingEmailVerification
source: Successfully registered, waiting for email verification
de_de: Erfolgreich registriert, wartet auf E-Mail-Verifizierung
es_es: Registrado con éxito, esperando verificación de correo electrónico
fr_fr: Enregistré avec succès, en attente de vérification par e-mail
id_id: Pendaftaran berhasil, tunggu verifikasi email
ja_jp: 正常に登録されました。メールは確認待ちです。
ko_kr: 성공적으로 등록이 되었으며 이메일 인증 대기 중입니다.
ru_ru: Регистрация успешна, ожидание подтверждения электронной почты
vi_vn: Đăng ký thành công, đang chờ xác minh email
zh_tw: 註冊成功，等待郵箱驗證

# Account_UserUpdated
source: User updated: {0} => {1}
de_de: Benutzer aktualisiert: {0} => {1}
es_es: Usuario actualizado: {0} => {1}
fr_fr: Utilisateur mis à jour : {0} => {1}
id_id: Pengguna diperbarui: {0} => {1}
ja_jp: ユーザーは更新されました：{0} => {1}
ko_kr: 사용자가 업데이트 되었습니다: {0} =>{1}
ru_ru: Имя пользователя изменено: {0} => {1}
vi_vn: Đã cập nhật người dùng: {0} => {1}
zh_tw: 用戶更新：{0} => {1}

# Account_UserUpdateFailed
source: User update failed
de_de: Benutzeraktualisierung fehlgeschlagen
es_es: Error en la actualización del usuario
fr_fr: Échec de la mise à jour de l'utilisateur
id_id: Pengguna gagal diperbarui
ja_jp: ユーザーの更新に失敗しました
ko_kr: 사용자 업데이트 실패
ru_ru: Не удалось изменить имя пользователя
vi_vn: Cập nhật người dùng thất bại
zh_tw: 用戶更新失敗

# Admin_CaptainDeletionNotAllowed
source: You cannot delete captain
de_de: Sie können den Kapitän nicht löschen
es_es: No puedes eliminar al capitán
fr_fr: Vous ne pouvez pas supprimer le capitaine
id_id: Kamu tidak dapat menghapus kapten
ja_jp: チームリーダーを削除することはできません
ko_kr: 팀장은 삭제할 수 없습니다.
ru_ru: Вы не можете удалить капитана
vi_vn: Bạn không thể khai trừ đội trưởng
zh_tw: 不可以刪除隊長

# Admin_ContainerInstanceDestroyFailed
source: Container destruction failed
de_de: Container-Zerstörung fehlgeschlagen
es_es: Falló la destrucción del contenedor
fr_fr: Échec de la destruction du conteneur
id_id: Penghapusan container gagal
ja_jp: コンテナインスタンス破棄に失敗しました
ko_kr: 컨테이너 삭제에 실패하였습니다.
ru_ru: Не удалось уничтожить контейнер
vi_vn: Tiêu hủy container thất bại
zh_tw: 容器實例銷毀失敗

# Admin_ContainerInstanceNotFound
source: Container not found
de_de: Container nicht gefunden
es_es: Contenedor no encontrado
fr_fr: Conteneur introuvable
id_id: Container tidak ditemukan
ja_jp: コンテナインスタンスを見つかりませんでした
ko_kr: 컨테이너를 찾을 수 없습니다.
ru_ru: Контейнер не найден
vi_vn: Không tìm thấy container
zh_tw: 容器實例未找到

# Admin_ParticipationNotFound
source: Participation not found
de_de: Teilnahme nicht gefunden
es_es: Participación no encontrada
fr_fr: Participation non trouvée
id_id: Partisipan tidak ditemukan
ja_jp: 参加状況を見つかりませんでした
ko_kr: 참여자를 찾을 수 없습니다.
ru_ru: Запись участия не найдена
vi_vn: Không tìm thấy trạng thái gia nhập
zh_tw: 參與狀態未找到

# Admin_SelfDeletionNotAllowed
source: You cannot delete yourself
de_de: Sie können sich nicht selbst löschen
es_es: No puedes eliminarte a ti mismo
fr_fr: Vous ne pouvez pas vous supprimer
id_id: Anda tidak dapat menghapus akun anda sendiri
ja_jp: 自分自身を削除することはできません
ko_kr: 자신을 삭제할 수 없습니다.
ru_ru: Нельзя удалить самого себя
vi_vn: Bạn không thể khai trừ chính mình
zh_tw: 不可以刪除自己

source: Team not found
de_de: Team nicht gefunden
es_es: Equipo no encontrado
fr_fr: Équipe non trouvée
id_id: Tim tidak ditemukan
ja_jp: チームは見つかりませんでした
ko_kr: 팀을 찾을 수 없습니다.
ru_ru: Команда не найдена
vi_vn: Đội không tồn tại
zh_tw: 隊伍未找到

# Admin_UserBatchAdded
source: Successfully added {0} users
de_de: Erfolgreich {0} Benutzer hinzugefügt
es_es: Se añadieron {0} usuarios exitosamente
fr_fr: Ajouté avec succès {0} utilisateur
id_id: Berhasil menambahkan {0} pengguna
ja_jp: {0} 人のユーザーを一括追加しました
ko_kr: {0} 사용자들을 성공적으로 추가하였습니다.
ru_ru: Успешно добавлено {0} пользователей
vi_vn: Đã thêm thành công {0} người dùng
zh_tw: 成功批量添加 {0} 個用戶

# Admin_UserNotFound
source: User not found
de_de: Benutzer nicht gefunden
es_es: Usuario no encontrado
fr_fr: Utilisateur non trouvé
id_id: Pengguna tidak ditemukan
ja_jp: ユーザーが見つかりませんでした
ko_kr: 사용자를 찾을 수 없습니다.
ru_ru: Пользователь не найден
vi_vn: Không tìm thấy người dùng
zh_tw: 用戶未找到

# Assets_DeleteFile
source: Deleting file [{0}]...
de_de: Datei [{0}] wird gelöscht...
es_es: Eliminando archivo [{0}]...
fr_fr: Suppression du fichier [{0}]...
id_id: Menghapus file [{0}]...
ja_jp: ファイル [{0}] を削除しています...
ko_kr: [{0}] 파일을 삭제 중입니다...
ru_ru: Удаление файла [{0}]...
vi_vn: Đang xóa tệp [{0}]...
zh_tw: 刪除文件 [{0}]...

# Assets_IOError
source: Encountered an IO error
de_de: Ein IO-Fehler ist aufgetreten
es_es: Se encontró un error de IO
fr_fr: Erreur IO rencontrée
id_id: Terjadi kesalahan IO
ja_jp: I/O エラーが発生しました
ko_kr: IO 오류가 발생하였습니다.
ru_ru: Произошла I/O ошибка
vi_vn: Đã gặp lỗi IO
zh_tw: 遇到IO錯誤

# Assets_FileNotFound
source: Attempting to fetch non-existing file [{0}] {1}
de_de: Versuch, nicht vorhandene Datei zu holen [{0}] {1}
es_es: Intentando obtener un archivo inexistente [{0}] {1}
fr_fr: Tentative de récupérer le fichier inexistant [{0}] {1}
id_id: Mencoba mengambil file yang tidak ada [{0}] {1}
ja_jp: 存在しないファイル [{0}] {1} を取得しようとしています
ko_kr: 존재하지 않는 파일 [{0}] {1} 을 가져오는 중입니다.
ru_ru: Попытка получить несуществующий файл [{0}] {1}
vi_vn: Tệp [{0}] {1} không tồn tại
zh_tw: 嘗試獲取不存在的文件 [{0}] {1}

# Assets_UpdateFile
source: File updated [{0}] {1} @ {2} bytes
de_de: Datei aktualisiert [{0}] {1} @ {2} Bytes
es_es: Archivo actualizado [{0}] {1} @ {2} bytes
fr_fr: Fichier mis à jour [{0}] {1} @ {2} octets
id_id: File sudah diperbarui [{0}] {1} @ {2} bytes
ja_jp: ファイルを更新します [{0}] {1} @ {2} bytes
ko_kr: 파일 업데이트 완료 [{0}] {1} @ {2} bytes
ru_ru: Файл обновлен [{0}] {1} @ {2} байт
vi_vn: Đã cập nhật tệp [{0}] {1} @ {2} bytes
zh_tw: 更新文件 [{0}] {1} @ {2} bytes

# Auth_AccessForbidden
source: Access denied
de_de: Zugriff verweigert
es_es: Acceso denegado
fr_fr: Accès refusé
id_id: Akses ditolak
ja_jp: アクセスが拒否されました
ko_kr: 액세스 거부
ru_ru: Отказано в доступе
vi_vn: Truy cập bị từ chối
zh_tw: 無權訪問

# Auth_LoginRequired
source: Please log in first
de_de: Bitte loggen Sie sich zuerst ein
es_es: Por favor inicie sesión primero
fr_fr: Veuillez vous connecter d'abord
id_id: Harap login terlebih dahulu
ja_jp: ログインしてください
ko_kr: 로그인을 먼저 해주세요.
ru_ru: Сначала войдите в аккаунт
vi_vn: Vui lòng đăng nhập trước
zh_tw: 請先登錄

# Auth_PathAccessForbidden
source: Unauthorized access: {0}
de_de: Unbefugter Zugriff: {0}
es_es: Acceso no autorizado: {0}
fr_fr: Accès non autorisé : {0}
id_id: Akses tidak diizinkan: {0}
ja_jp: アクセスが許可されていません：{0}
ko_kr: 무단 액세스: {0}
ru_ru: Неавторизованный доступ: {0}
vi_vn: Truy cập trái phép: {0}
zh_tw: 未經授權的訪問：{0}

# Avatar_UpdateFailed
source: User avatar update failed
de_de: Benutzer-Avatar-Update fehlgeschlagen
es_es: La actualización del avatar del usuario falló
fr_fr: Échec de la mise à jour de l'avatar de l'utilisateur
id_id: Avatar pengguna gagal diperbarui
ja_jp: アバターの更新に失敗しました
ko_kr: 사용자 아바타 업데이트 실패
ru_ru: Не удалось обновить аватар пользователя
vi_vn: Cập nhật ảnh đại diện người dùng thất bại
zh_tw: 用戶頭像更新失敗

# Cache_GenerationFailed
source: Cache generation failed: {0}
de_de: Cache-Generierung fehlgeschlagen: {0}
es_es: Fallo en la generación de caché: {0}
fr_fr: Échec de la génération du cache : {0}
id_id: Generate cache gagal: {0}
ja_jp: キャッシュの生成に失敗しました：{0}
ko_kr: 캐시 생성 실패: {0}
ru_ru: Не удалось сформировать кэш: {0}
vi_vn: Tạo bộ nhớ cache thất bại: {0}
zh_tw: 緩存生成失敗：{0}

# Cache_InvalidUpdateRequest
source: Invalid cache request: {0}
de_de: Ungültige Cache-Anfrage: {0}
es_es: Solicitud de caché inválida: {0}
fr_fr: Requête de cache invalide : {0}
id_id: Permintaan cache tidak valid: {0}
ja_jp: 無効なキャッシュ更新リクエスト：{0}
ko_kr: 유효하지 않은 캐시 요청: {0}
ru_ru: Неверный запрос кэша: {0}
vi_vn: Yêu cầu bộ nhớ cache không hợp lệ: {0}
zh_tw: 無效的緩存更新請求：{0}

# Cache_NoMatchingRequest
source: No matching request found for cache worker: {0}
de_de: Keine passende Anfrage für Cache-Worker gefunden: {0}
es_es: No se encontró ninguna solicitud coincidente para el trabajador de caché: {0}
fr_fr: Aucune requête correspondante trouvée pour le travailleur de cache : {0}
id_id: Tidak ada permintaan yang cocok untuk cache worker: {0}
ja_jp: キャッシュ更新ワーカーに一致するリクエストが見つかりませんでした：{0}
ko_kr: 캐시 워커에 일치하는 요청이 없습니다: {0}
ru_ru: Не найден соответствующий запрос для обработчика кэша: {0}
vi_vn: Không tìm thấy yêu cầu phù hợp cho cache worker: {0}
zh_tw: 緩存更新線程未找到匹配的請求：{0}

# Cache_Rebuilt
source: Rebuild cache: {0} @ {1} bytes
ja_jp: キャッシュが再構築されました：{0} @ {1} bytes

# Cache_Stopped
source: Cache update has been stopped
de_de: Cache-Update wurde gestoppt
es_es: La actualización de caché se ha detenido
fr_fr: La mise à jour du cache a été arrêtée
id_id: Pembaruan cache telah dihentikan
ja_jp: キャッシュの更新が停止されました
ko_kr: 캐시 업데이트가 중단되었습니다.
ru_ru: Обновление кэша остановлено
vi_vn: Đã dừng cập nhật bộ nhớ cache
zh_cn: 缓存更新已停用
zh_tw: 緩存更新已停用

# Cache_Updated
source: Cache updated: {0} @ {1} bytes
de_de: Cache aktualisiert: {0}[{1}] @ {2} Bytes
es_es: Cache actualizado: {0}[{1}] @ {2} bytes
fr_fr: Cache mis à jour : {0}[{1}] @ {2} octets
id_id: Cache sudah diperbarui: {0}[{1}] @ {2} bytes
ja_jp: キャッシュが更新されました：{0} @ {1} bytes
ko_kr: 캐시 업데이트됨: {0}[{1}] @ {2} bytes
ru_ru: Кэш обновлен: {0}[{1}] @ {2} байт
vi_vn: Bộ nhớ cache được cập nhật: {0}[{1}] @ {2} byte
zh_tw: 緩存已更新：{0}[{1}] @ {2} bytes

# Cache_UpdateWorkerFailed
source: Cache update failed: {0} @ {1}
de_de: Cache-Update fehlgeschlagen: {0} @ {1}
es_es: Actualización de caché fallida: {0} @ {1}
fr_fr: Échec de la mise à jour du cache : {0} @ {1}
id_id: Cache gagal di perbarui: {0} @ {1}
ja_jp: キャッシュ更新ワーカーが更新に失敗しました：{0} @ {1}
ko_kr: 캐시 업데이트 실패: {0} @ {1}
ru_ru: Не удалось обновить кэш: {0} @ {1}
vi_vn: Cập nhật bộ nhớ cache thất bại: {0} @ {1}
zh_tw: 緩存更新線程更新失敗：{0} @ {1}

# Cache_UpdateWorkerLocked
source: Cache update worker locked: {0}
de_de: Cache-Update-Worker gesperrt: {0}
es_es: Trabajador de actualización de caché bloqueado: {0}
fr_fr: Travailleur de mise à jour du cache verrouillé : {0}
id_id: Worker pembaruan cache terkunci: {0}
ja_jp: キャッシュ更新ワーカーがロックされています：{0}
ko_kr: 캐시 업데이트 워커 잠김: {0}
ru_ru: Обработчик обновления кэша заблокирован: {0}
vi_vn: Worker cập nhật bộ nhớ cache bị khóa: {0}
zh_tw: 緩存更新線程已鎖定：{0}

# Cache_WorkerCancelled
source: Cache update worker is stopping because task has been cancelled
de_de: Cache-Update-Worker wird gestoppt, da die Aufgabe abgebrochen wurde
es_es: El trabajador de actualización de caché se detiene porque la tarea ha sido cancelada
fr_fr: Le travailleur de mise à jour du cache s'arrête car la tâche a été annulée
id_id: Worker pembaruan cache berhenti karena tugas telah dibatalkan
ja_jp: タスクがキャンセルされたため、キャッシュの更新ワーカーを停止します
ko_kr: 캐시 업데이터 워커가 중단되었습니다.
ru_ru: Обработчик обновления кэша остановлен, потому что задание было отменено
vi_vn: Worker cập nhật bộ nhớ cache đang dừng vì tác vụ đã bị hủy
zh_cn: 任务取消，缓存更新线程将退出
zh_tw: 任務取消，緩存更新線程將退出

# Cache_WorkerStarted
source: Cache update worker has been started
de_de: Cache-Update-Worker wurde gestartet
es_es: El trabajador de actualización de caché ha comenzado
fr_fr: Le travailleur de mise à jour du cache a été démarré
id_id: Worker pembaruan cache sudah dimulai
ja_jp: キャッシュの更新ワーカーが起動されました
ko_kr: 캐시 업데이트 워커가 실행되었습니다.
ru_ru: Обработчик обновления кэша запущен
vi_vn: Worker cập nhật bộ nhớ cache đã chạy
zh_cn: 缓存更新线程已启动
zh_tw: 緩存更新線程已啟動

# Cache_WorkerStopped
source: Cache update worker has been stopped
de_de: Cache-Update-Worker wurde gestoppt
es_es: El trabajador de actualización de caché ha sido detenido
fr_fr: Le travailleur de mise à jour du cache a été arrêté
id_id: Worker pembaruan cache sudah dihentikan
ja_jp: キャッシュの更新ワーカーが停止されました
ko_kr: 캐시 업데이트 워커가 중단되었습니다.
ru_ru: Обработчик обновления кэша остановлен
vi_vn: Worker cập nhật bộ nhớ cache đã dừng
zh_cn: 缓存更新线程已退出
zh_tw: 緩存更新線程已退出

# Challenge_NotFound
source: The challenge was not found
de_de: Die Herausforderung wurde nicht gefunden
es_es: El desafío no fue encontrado
fr_fr: Le défi n'a pas été trouvé
id_id: Challenge tidak ditemukan
ja_jp: チャレンジは見つかりませんでした
ko_kr: 해당 문제를 찾을 수 없습니다.
ru_ru: Задание не найдено
vi_vn: Không tìm thấy thử thách
zh_cn: 题目未找到
zh_tw: 題目未找到
